RT-Thread/rt-thread/bsp/freescale/platform/devices/MKW30Z4/include/MKW30Z4_extension.h
/*******************************************************************************
 * ROM_PERIPHID2 - Peripheral ID Register
 ******************************************************************************/

/*!
 * @brief ROM_PERIPHID2 - Peripheral ID Register (RO)
 *
 * Reset value: 0x00000000U
 *
 * These registers indicate the peripheral IDs. They are hardwired to specific
 * values used during the auto-discovery process by an external debug agent.
 */
/*!
 * @name Constants and macros for entire ROM_PERIPHID2 register
 */
/*@{*/
#define ROM_RD_PERIPHID2(base)   (ROM_PERIPHID2_REG(base))
/*@}*/

/*******************************************************************************
 * ROM_PERIPHID3 - Peripheral ID Register
 ******************************************************************************/

/*!
 * @brief ROM_PERIPHID3 - Peripheral ID Register (RO)
 *
 * Reset value: 0x00000000U
 *
 * These registers indicate the peripheral IDs. They are hardwired to specific
 * values used during the auto-discovery process by an external debug agent.
 */
/*!
 * @name Constants and macros for entire ROM_PERIPHID3 register
 */
/*@{*/
#define ROM_RD_PERIPHID3(base)   (ROM_PERIPHID3_REG(base))
/*@}*/

/*******************************************************************************
 * ROM_COMPID - Component ID Register
 ******************************************************************************/

/*!
 * @brief ROM_COMPID - Component ID Register (RO)
 *
 * Reset value: 0x00000000U
 *
 * These registers indicate the component IDs. They are hardwired to specific
 * values used during the auto-discovery process by an external debug agent.
 */
/*!
 * @name Constants and macros for entire ROM_COMPID register
 */
/*@{*/
#define ROM_RD_COMPID(base, index) (ROM_COMPID_REG(base, index))
/*@}*/

/*
 * MKW30Z4 RSIM
 *
 * Radio System Integration Module
 *
 * Registers defined in this header file:
 * - RSIM_CONTROL - RSIM Control
 * - RSIM_ACTIVE_DELAY - RSIM BLE Active Delay
 * - RSIM_MAC_MSB - RSIM MAC MSB
 * - RSIM_MAC_LSB - RSIM MAC LSB
 * - RSIM_ANA_TEST - RSIM Analog Test
 */

#define RSIM_INSTANCE_COUNT (1U) /*!< Number of instances of the RSIM module. */
#define RSIM_IDX (0U) /*!< Instance number for RSIM. */

/*******************************************************************************
 * RSIM_CONTROL - RSIM Control
 ******************************************************************************/

/*!
 * @brief RSIM_CONTROL - RSIM Control (RW)
 *
 * Reset value: 0x00C00000U
 *
 * The RSIM Control register provides various control bits for the Radio System
 * and for its interaction with the SoC Systems.
 */
/*!
 * @name Constants and macros for entire RSIM_CONTROL register
 */
/*@{*/
#define RSIM_RD_CONTROL(base)    (RSIM_CONTROL_REG(base))
#define RSIM_WR_CONTROL(base, value) (RSIM_CONTROL_REG(base) = (value))
#define RSIM_RMW_CONTROL(base, mask, value) (RSIM_WR_CONTROL(base, (RSIM_RD_CONTROL(base) & ~(mask)) | (value)))
#define RSIM_SET_CONTROL(base, value) (BME_OR32(&RSIM_CONTROL_REG(base), (uint32_t)(value)))
#define RSIM_CLR_CONTROL(base, value) (BME_AND32(&RSIM_CONTROL_REG(base), (uint32_t)(~(value))))
#define RSIM_TOG_CONTROL(base, value) (BME_XOR32(&RSIM_CONTROL_REG(base), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual RSIM_CONTROL bitfields
 */

/*!
 * @name Register RSIM_CONTROL, field BLE_RF_OSC_REQ_EN[0] (RW)
 *
 * This bit resets on POR only. If this bit is cleared (the default state), then
 * all BLE link layer requests to turn on the RF Ref Oscillator (Sysclk Req)
 * will be blocked and ignored. In BLE protocols the BLE link layer will always
 * restart when exiting reset by first Requesting the RF Ref Osc (Sysclk Req), this
 * bit blocks that behavior until software configures the Radio and enables the
 * requests.
 */
/*@{*/
/*! @brief Read current value of the RSIM_CONTROL_BLE_RF_OSC_REQ_EN field. */
#define RSIM_RD_CONTROL_BLE_RF_OSC_REQ_EN(base) ((RSIM_CONTROL_REG(base) & RSIM_CONTROL_BLE_RF_OSC_REQ_EN_MASK) >> RSIM_CONTROL_BLE_RF_OSC_REQ_EN_SHIFT)
#define RSIM_BRD_CONTROL_BLE_RF_OSC_REQ_EN(base) (BME_UBFX32(&RSIM_CONTROL_REG(base), RSIM_CONTROL_BLE_RF_OSC_REQ_EN_SHIFT, RSIM_CONTROL_BLE_RF_OSC_REQ_EN_WIDTH))

/*! @brief Set the BLE_RF_OSC_REQ_EN field to a new value. */
#define RSIM_WR_CONTROL_BLE_RF_OSC_REQ_EN(base, value) (RSIM_RMW_CONTROL(base, (RSIM_CONTROL_BLE_RF_OSC_REQ_EN_MASK | RSIM_CONTROL_BLE_RF_OSC_REQ_INT_MASK), RSIM_CONTROL_BLE_RF_OSC_REQ_EN(value)))
#define RSIM_BWR_CONTROL_BLE_RF_OSC_REQ_EN(base, value) (BME_BFI32(&RSIM_CONTROL_REG(base), ((uint32_t)(value) << RSIM_CONTROL_BLE_RF_OSC_REQ_EN_SHIFT), RSIM_CONTROL_BLE_RF_OSC_REQ_EN_SHIFT, RSIM_CONTROL_BLE_RF_OSC_REQ_EN_WIDTH))
/*@}*/

/*!
 * @name Register RSIM_CONTROL, field BLE_RF_OSC_REQ_STAT[1] (RO)
 *
 * This bit indicates the current status of the BLE link layer request to turn
 * on the RF Ref Oscillator (Sysclk Req).
 */
/*@{*/
/*! @brief Read current value of the RSIM_CONTROL_BLE_RF_OSC_REQ_STAT field. */
#define RSIM_RD_CONTROL_BLE_RF_OSC_REQ_STAT(base) ((RSIM_CONTROL_REG(base) & RSIM_CONTROL_BLE_RF_OSC_REQ_STAT_MASK) >> RSIM_CONTROL_BLE_RF_OSC_REQ_STAT_SHIFT)
#define RSIM_BRD_CONTROL_BLE_RF_OSC_REQ_STAT(base) (BME_UBFX32(&RSIM_CONTROL_REG(base), RSIM_CONTROL_BLE_RF_OSC_REQ_STAT_SHIFT, RSIM_CONTROL_BLE_RF_OSC_REQ_STAT_WIDTH))
/*@}*/

/*!
 * @name Register RSIM_CONTROL, field BLE_RF_OSC_REQ_INT_EN[4] (RW)
 *
 * This bit enables an interrupt request when the enabled version of the BLE Ref
 * Osc (Sysclk) Request is asserted high.
 */
/*@{*/
/*! @brief Read current value of the RSIM_CONTROL_BLE_RF_OSC_REQ_INT_EN field. */
#define RSIM_RD_CONTROL_BLE_RF_OSC_REQ_INT_EN(base) ((RSIM_CONTROL_REG(base) & RSIM_CONTROL_BLE_RF_OSC_REQ_INT_EN_MASK) >> RSIM_CONTROL_BLE_RF_OSC_REQ_INT_EN_SHIFT)
#define RSIM_BRD_CONTROL_BLE_RF_OSC_REQ_INT_EN(base) (BME_UBFX32(&RSIM_CONTROL_REG(base), RSIM_CONTROL_BLE_RF_OSC_REQ_INT_EN_SHIFT, RSIM_CONTROL_BLE_RF_OSC_REQ_INT_EN_WIDTH))

/*! @brief Set the BLE_RF_OSC_REQ_INT_EN field to a new value. */
#define RSIM_WR_CONTROL_BLE_RF_OSC_REQ_INT_EN(base, value) (RSIM_RMW_CONTROL(base, (RSIM_CONTROL_BLE_RF_OSC_REQ_INT_EN_MASK | RSIM_CONTROL_BLE_RF_OSC_REQ_INT_MASK), RSIM_CONTROL_BLE_RF_OSC_REQ_INT_EN(value)))
#define RSIM_BWR_CONTROL_BLE_RF_OSC_REQ_INT_EN(base, value) (BME_BFI32(&RSIM_CONTROL_REG(base), ((uint32_t)(value) << RSIM_CONTROL_BLE_RF_OSC_REQ_INT_EN_SHIFT), RSIM_CONTROL_BLE_RF_OSC_REQ_INT_EN_SHIFT, RSIM_CONTROL_BLE_RF_OSC_REQ_INT_EN_WIDTH))
/*@}*/

/*!
 * @name Register RSIM_CONTROL, field BLE_RF_OSC_REQ_INT[5] (W1C)
 *
 * This bit is an interrupt flag that is set when the enabled version of the BLE
 * Ref Osc (Sysclk) Request is asserted high. This interrupt flag is cleared by
 * writing a 1 to it.
 */
/*@{*/
/*! @brief Read current value of the RSIM_CONTROL_BLE_RF_OSC_REQ_INT field. */
#define RSIM_RD_CONTROL_BLE_RF_OSC_REQ_INT(base) ((RSIM_CONTROL_REG(base) & RSIM_CONTROL_BLE_RF_OSC_REQ_INT_MASK) >> RSIM_CONTROL_BLE_RF_OSC_REQ_INT_SHIFT)
#define RSIM_BRD_CONTROL_BLE_RF_OSC_REQ_INT(base) (BME_UBFX32(&RSIM_CONTROL_REG(base), RSIM_CONTROL_BLE_RF_OSC_REQ_INT_SHIFT, RSIM_CONTROL_BLE_RF_OSC_REQ_INT_WIDTH))

