RT-Thread/rt-thread/bsp/freescale/platform/devices/MKW30Z4/include/MKW30Z4_extension.h
/*! @brief Set the BLE_RF_OSC_REQ_INT field to a new value. */
#define RSIM_WR_CONTROL_BLE_RF_OSC_REQ_INT(base, value) (RSIM_RMW_CONTROL(base, RSIM_CONTROL_BLE_RF_OSC_REQ_INT_MASK, RSIM_CONTROL_BLE_RF_OSC_REQ_INT(value)))
#define RSIM_BWR_CONTROL_BLE_RF_OSC_REQ_INT(base, value) (BME_BFI32(&RSIM_CONTROL_REG(base), ((uint32_t)(value) << RSIM_CONTROL_BLE_RF_OSC_REQ_INT_SHIFT), RSIM_CONTROL_BLE_RF_OSC_REQ_INT_SHIFT, RSIM_CONTROL_BLE_RF_OSC_REQ_INT_WIDTH))
/*@}*/

/*!
 * @name Register RSIM_CONTROL, field RF_OSC_EN[11:8] (RW)
 *
 * The RF Reference Oscillator can be enabled by the BLE link layer, by an SoC
 * MCG mode, or by these bits. If these bits are all cleared, 0000, then the RF
 * Ref Osc will be controlled by the SoC or the BLE link layer. If any of these
 * bits are set then the RF Ref Osc will be on in the SoC power modes as shown
 * below. Note that the enables are additive; each bit adds another low power mode.
 *
 * Values:
 * - 0b0000 - RF Ref Osc will be controlled by the SoC or the BLE link layer
 * - 0b0001 - RF Ref Osc on in Run/Wait
 * - 0b0011 - RF Ref Osc on in Stop
 * - 0b0111 - RF Ref Osc on in VLPR/VLPW
 * - 0b1111 - RF Ref Osc on in VLPS
 */
/*@{*/
/*! @brief Read current value of the RSIM_CONTROL_RF_OSC_EN field. */
#define RSIM_RD_CONTROL_RF_OSC_EN(base) ((RSIM_CONTROL_REG(base) & RSIM_CONTROL_RF_OSC_EN_MASK) >> RSIM_CONTROL_RF_OSC_EN_SHIFT)
#define RSIM_BRD_CONTROL_RF_OSC_EN(base) (BME_UBFX32(&RSIM_CONTROL_REG(base), RSIM_CONTROL_RF_OSC_EN_SHIFT, RSIM_CONTROL_RF_OSC_EN_WIDTH))

/*! @brief Set the RF_OSC_EN field to a new value. */
#define RSIM_WR_CONTROL_RF_OSC_EN(base, value) (RSIM_RMW_CONTROL(base, (RSIM_CONTROL_RF_OSC_EN_MASK | RSIM_CONTROL_BLE_RF_OSC_REQ_INT_MASK), RSIM_CONTROL_RF_OSC_EN(value)))
#define RSIM_BWR_CONTROL_RF_OSC_EN(base, value) (BME_BFI32(&RSIM_CONTROL_REG(base), ((uint32_t)(value) << RSIM_CONTROL_RF_OSC_EN_SHIFT), RSIM_CONTROL_RF_OSC_EN_SHIFT, RSIM_CONTROL_RF_OSC_EN_WIDTH))
/*@}*/

/*!
 * @name Register RSIM_CONTROL, field GASKET_BYPASS_OVRD_EN[12] (RW)
 *
 * The SoC platform has an asynchronous gasket that allows register access for
 * the Radio registers in all SoC clocking modes. This bit allows software to
 * directly control the SoC platform asynchronous gasket bypass signal.
 */
/*@{*/
/*! @brief Read current value of the RSIM_CONTROL_GASKET_BYPASS_OVRD_EN field. */
#define RSIM_RD_CONTROL_GASKET_BYPASS_OVRD_EN(base) ((RSIM_CONTROL_REG(base) & RSIM_CONTROL_GASKET_BYPASS_OVRD_EN_MASK) >> RSIM_CONTROL_GASKET_BYPASS_OVRD_EN_SHIFT)
#define RSIM_BRD_CONTROL_GASKET_BYPASS_OVRD_EN(base) (BME_UBFX32(&RSIM_CONTROL_REG(base), RSIM_CONTROL_GASKET_BYPASS_OVRD_EN_SHIFT, RSIM_CONTROL_GASKET_BYPASS_OVRD_EN_WIDTH))

/*! @brief Set the GASKET_BYPASS_OVRD_EN field to a new value. */
#define RSIM_WR_CONTROL_GASKET_BYPASS_OVRD_EN(base, value) (RSIM_RMW_CONTROL(base, (RSIM_CONTROL_GASKET_BYPASS_OVRD_EN_MASK | RSIM_CONTROL_BLE_RF_OSC_REQ_INT_MASK), RSIM_CONTROL_GASKET_BYPASS_OVRD_EN(value)))
#define RSIM_BWR_CONTROL_GASKET_BYPASS_OVRD_EN(base, value) (BME_BFI32(&RSIM_CONTROL_REG(base), ((uint32_t)(value) << RSIM_CONTROL_GASKET_BYPASS_OVRD_EN_SHIFT), RSIM_CONTROL_GASKET_BYPASS_OVRD_EN_SHIFT, RSIM_CONTROL_GASKET_BYPASS_OVRD_EN_WIDTH))
/*@}*/

/*!
 * @name Register RSIM_CONTROL, field GASKET_BYPASS_OVRD[13] (RW)
 *
 * This bit directly controls the SoC platform asynchronous gasket bypass signal
 * when the Gasket Bypass Override is enabled. The default behavior of the SoC
 * Asynchronous Gasket is Not Bypassed, which means the Radio registers are
 * accessed using the RF Ref Osc clock. The Radio sends the RF Ref Osc to the
 * asynchronous gasket which then uses that clock for SoC register accesses of the Radio
 * registers. This requires the RF Ref Osc to be Enabled and Ready. If the RF Ref
 * Osc is not Enabled and Ready, then the IPS Gasket can be overridden to be in
 * Bypass Mode, which forces the use of the SoC IPG clock as the register access
 * clock. If the RF Ref Osc IS Enabled and Ready, then the IPS Gasket can be
 * overridden to be in Bypass Mode, but this is an ILLEGALL ACCESS if the Radio is
 * operational, DO NOT write Radio registers with the Asynchronous Gasket Bypassed
 * when the Radio is Operating. Test mode access is allowed but glitches may
 * occur. The intent of Bypass Mode is to allow software to configure the Radio before
 * the RF Ref Osc is Enabled and Ready. Note that the BLE Link Layer registers
 * can only be accessed when the RF Ref Osc is Enabled and Ready. The following
 * table shows which clock is being used to access the Radio XCVR and Zigbee
 * registers. Gasket Bypass Override Enable Gasket Bypass Override XCVR and Zigbee
 * Register Clock 1 0 RF Ref Osc Clock 1 1 SoC IPG Clock 0 x RF Ref Osc Clock
 */
/*@{*/
/*! @brief Read current value of the RSIM_CONTROL_GASKET_BYPASS_OVRD field. */
#define RSIM_RD_CONTROL_GASKET_BYPASS_OVRD(base) ((RSIM_CONTROL_REG(base) & RSIM_CONTROL_GASKET_BYPASS_OVRD_MASK) >> RSIM_CONTROL_GASKET_BYPASS_OVRD_SHIFT)
#define RSIM_BRD_CONTROL_GASKET_BYPASS_OVRD(base) (BME_UBFX32(&RSIM_CONTROL_REG(base), RSIM_CONTROL_GASKET_BYPASS_OVRD_SHIFT, RSIM_CONTROL_GASKET_BYPASS_OVRD_WIDTH))

/*! @brief Set the GASKET_BYPASS_OVRD field to a new value. */
#define RSIM_WR_CONTROL_GASKET_BYPASS_OVRD(base, value) (RSIM_RMW_CONTROL(base, (RSIM_CONTROL_GASKET_BYPASS_OVRD_MASK | RSIM_CONTROL_BLE_RF_OSC_REQ_INT_MASK), RSIM_CONTROL_GASKET_BYPASS_OVRD(value)))
#define RSIM_BWR_CONTROL_GASKET_BYPASS_OVRD(base, value) (BME_BFI32(&RSIM_CONTROL_REG(base), ((uint32_t)(value) << RSIM_CONTROL_GASKET_BYPASS_OVRD_SHIFT), RSIM_CONTROL_GASKET_BYPASS_OVRD_SHIFT, RSIM_CONTROL_GASKET_BYPASS_OVRD_WIDTH))
/*@}*/

/*!
 * @name Register RSIM_CONTROL, field RF_OSC_BYPASS_EN[14] (RW)
 *
 * This bit engages the RF Ref Osc analog bypass circuit if the RF Ref Osc is
 * enabled. When the RF Ref Osc is in bypass mode it passes the EXTAL clock as the
 * RF Ref Osc clock. Note that the RF Ref Osc Ready signal is always asserted in
 * RF Ref Osc Bypass mode, unless overridden with the RF_OSC_READY_OVRD_EN bit.
 */
/*@{*/
/*! @brief Read current value of the RSIM_CONTROL_RF_OSC_BYPASS_EN field. */
#define RSIM_RD_CONTROL_RF_OSC_BYPASS_EN(base) ((RSIM_CONTROL_REG(base) & RSIM_CONTROL_RF_OSC_BYPASS_EN_MASK) >> RSIM_CONTROL_RF_OSC_BYPASS_EN_SHIFT)
#define RSIM_BRD_CONTROL_RF_OSC_BYPASS_EN(base) (BME_UBFX32(&RSIM_CONTROL_REG(base), RSIM_CONTROL_RF_OSC_BYPASS_EN_SHIFT, RSIM_CONTROL_RF_OSC_BYPASS_EN_WIDTH))

/*! @brief Set the RF_OSC_BYPASS_EN field to a new value. */
#define RSIM_WR_CONTROL_RF_OSC_BYPASS_EN(base, value) (RSIM_RMW_CONTROL(base, (RSIM_CONTROL_RF_OSC_BYPASS_EN_MASK | RSIM_CONTROL_BLE_RF_OSC_REQ_INT_MASK), RSIM_CONTROL_RF_OSC_BYPASS_EN(value)))
#define RSIM_BWR_CONTROL_RF_OSC_BYPASS_EN(base, value) (BME_BFI32(&RSIM_CONTROL_REG(base), ((uint32_t)(value) << RSIM_CONTROL_RF_OSC_BYPASS_EN_SHIFT), RSIM_CONTROL_RF_OSC_BYPASS_EN_SHIFT, RSIM_CONTROL_RF_OSC_BYPASS_EN_WIDTH))
/*@}*/

/*!
 * @name Register RSIM_CONTROL, field BLE_ACTIVE_PORT_1_SEL[16] (RW)
 *
 * This bit enables the Output Driver (OBE) on the SoC port 1 that provides the
 * BLE Active signal as a pad interface option.
 */
/*@{*/
/*! @brief Read current value of the RSIM_CONTROL_BLE_ACTIVE_PORT_1_SEL field. */
#define RSIM_RD_CONTROL_BLE_ACTIVE_PORT_1_SEL(base) ((RSIM_CONTROL_REG(base) & RSIM_CONTROL_BLE_ACTIVE_PORT_1_SEL_MASK) >> RSIM_CONTROL_BLE_ACTIVE_PORT_1_SEL_SHIFT)
#define RSIM_BRD_CONTROL_BLE_ACTIVE_PORT_1_SEL(base) (BME_UBFX32(&RSIM_CONTROL_REG(base), RSIM_CONTROL_BLE_ACTIVE_PORT_1_SEL_SHIFT, RSIM_CONTROL_BLE_ACTIVE_PORT_1_SEL_WIDTH))

