RT-Thread/rt-thread/bsp/freescale/platform/devices/MKW30Z4/include/MKW30Z4_extension.h
/*
 * MKW30Z4 XCVR
 *
 * Apache 1.0 Transceiver
 *
 * Registers defined in this header file:
 * - XCVR_RX_DIG_CTRL - RX Digital Control
 * - XCVR_AGC_CTRL_0 - AGC Control 0
 * - XCVR_AGC_CTRL_1 - AGC Control 1
 * - XCVR_AGC_CTRL_2 - AGC Control 2
 * - XCVR_AGC_CTRL_3 - AGC Control 3
 * - XCVR_AGC_STAT - AGC Status
 * - XCVR_RSSI_CTRL_0 - RSSI Control 0
 * - XCVR_RSSI_CTRL_1 - RSSI Control 1
 * - XCVR_DCOC_CTRL_0 - DCOC Control 0
 * - XCVR_DCOC_CTRL_1 - DCOC Control 1
 * - XCVR_DCOC_CTRL_2 - DCOC Control 2
 * - XCVR_DCOC_CTRL_3 - DCOC Control 3
 * - XCVR_DCOC_CTRL_4 - DCOC Control 4
 * - XCVR_DCOC_CAL_GAIN - DCOC Calibration Gain
 * - XCVR_DCOC_STAT - DCOC Status
 * - XCVR_DCOC_DC_EST - DCOC DC Estimate
 * - XCVR_DCOC_CAL_RCP - DCOC Calibration Reciprocals
 * - XCVR_IQMC_CTRL - IQMC Control
 * - XCVR_IQMC_CAL - IQMC Calibration
 * - XCVR_TCA_AGC_VAL_3_0 - TCA AGC Step Values 3..0
 * - XCVR_TCA_AGC_VAL_7_4 - TCA AGC Step Values 7..4
 * - XCVR_TCA_AGC_VAL_8 - TCA AGC Step Values 8
 * - XCVR_BBF_RES_TUNE_VAL_7_0 - BBF Resistor Tune Values 7..0
 * - XCVR_BBF_RES_TUNE_VAL_10_8 - BBF Resistor Tune Values 10..8
 * - XCVR_TCA_AGC_LIN_VAL_2_0 - TCA AGC Linear Gain Values 2..0
 * - XCVR_TCA_AGC_LIN_VAL_5_3 - TCA AGC Linear Gain Values 5..3
 * - XCVR_TCA_AGC_LIN_VAL_8_6 - TCA AGC Linear Gain Values 8..6
 * - XCVR_BBF_RES_TUNE_LIN_VAL_3_0 - BBF Resistor Tune Values 3..0
 * - XCVR_BBF_RES_TUNE_LIN_VAL_7_4 - BBF Resistor Tune Values 7..4
 * - XCVR_BBF_RES_TUNE_LIN_VAL_10_8 - BBF Resistor Tune Values 10..8
 * - XCVR_AGC_GAIN_TBL_03_00 - AGC Gain Tables Step 03..00
 * - XCVR_AGC_GAIN_TBL_07_04 - AGC Gain Tables Step 07..04
 * - XCVR_AGC_GAIN_TBL_11_08 - AGC Gain Tables Step 11..08
 * - XCVR_AGC_GAIN_TBL_15_12 - AGC Gain Tables Step 15..12
 * - XCVR_AGC_GAIN_TBL_19_16 - AGC Gain Tables Step 19..16
 * - XCVR_AGC_GAIN_TBL_23_20 - AGC Gain Tables Step 23..20
 * - XCVR_AGC_GAIN_TBL_26_24 - AGC Gain Tables Step 26..24
 * - XCVR_DCOC_OFFSET_ - DCOC Offset
 * - XCVR_DCOC_TZA_STEP_ - DCOC TZA DC step
 * - XCVR_DCOC_CAL_ALPHA - DCOC Calibration Alpha
 * - XCVR_DCOC_CAL_BETA - DCOC Calibration Beta
 * - XCVR_DCOC_CAL_GAMMA - DCOC Calibration Gamma
 * - XCVR_DCOC_CAL_IIR - DCOC Calibration IIR
 * - XCVR_DCOC_CAL - DCOC Calibration Result
 * - XCVR_RX_CHF_COEF - Receive Channel Filter Coefficient
 * - XCVR_TX_DIG_CTRL - TX Digital Control
 * - XCVR_TX_DATA_PAD_PAT - TX Data Padding Pattern
 * - XCVR_TX_GFSK_MOD_CTRL - TX GFSK Modulation Control
 * - XCVR_TX_GFSK_COEFF2 - TX GFSK Filter Coefficients 2
 * - XCVR_TX_GFSK_COEFF1 - TX GFSK Filter Coefficients 1
 * - XCVR_TX_FSK_MOD_SCALE - TX FSK Modulation Scale
 * - XCVR_TX_DFT_MOD_PAT - TX DFT Modulation Pattern
 * - XCVR_TX_DFT_TONE_0_1 - TX DFT Tones 0 and 1
 * - XCVR_TX_DFT_TONE_2_3 - TX DFT Tones 2 and 3
 * - XCVR_PLL_MOD_OVRD - PLL Modulation Overrides
 * - XCVR_PLL_CHAN_MAP - PLL Channel Mapping
 * - XCVR_PLL_LOCK_DETECT - PLL Lock Detect
 * - XCVR_PLL_HP_MOD_CTRL - PLL High Port Modulation Control
 * - XCVR_PLL_HPM_CAL_CTRL - PLL HPM Calibration Control
 * - XCVR_PLL_LD_HPM_CAL1 - PLL Cycle Slip Lock Detect Configuration and HPM Calibration 1
 * - XCVR_PLL_LD_HPM_CAL2 - PLL Cycle Slip Lock Detect Configuration and HPM Calibration 2
 * - XCVR_PLL_HPM_SDM_FRACTION - PLL HPM SDM Fraction
 * - XCVR_PLL_LP_MOD_CTRL - PLL Low Port Modulation Control
 * - XCVR_PLL_LP_SDM_CTRL1 - PLL Low Port SDM Control 1
 * - XCVR_PLL_LP_SDM_CTRL2 - PLL Low Port SDM Control 2
 * - XCVR_PLL_LP_SDM_CTRL3 - PLL Low Port SDM Control 3
 * - XCVR_PLL_LP_SDM_NUM - PLL Low Port SDM Numerator Applied
 * - XCVR_PLL_LP_SDM_DENOM - PLL Low Port SDM Denominator Applied
 * - XCVR_PLL_DELAY_MATCH - PLL Delay Matching
 * - XCVR_PLL_CTUNE_CTRL - PLL Coarse Tune Control
 * - XCVR_PLL_CTUNE_CNT6 - PLL Coarse Tune Count 6
 * - XCVR_PLL_CTUNE_CNT5_4 - PLL Coarse Tune Counts 5 and 4
 * - XCVR_PLL_CTUNE_CNT3_2 - PLL Coarse Tune Counts 3 and 2
 * - XCVR_PLL_CTUNE_CNT1_0 - PLL Coarse Tune Counts 1 and 0
 * - XCVR_PLL_CTUNE_RESULTS - PLL Coarse Tune Results
 * - XCVR_CTRL - Transceiver Control
 * - XCVR_STATUS - Transceiver Status
 * - XCVR_SOFT_RESET - Soft Reset
 * - XCVR_OVERWRITE_VER - Overwrite Version
 * - XCVR_DMA_CTRL - DMA Control
 * - XCVR_DMA_DATA - DMA Data
 * - XCVR_DTEST_CTRL - Digital Test Control
 * - XCVR_PB_CTRL - Packet Buffer Control Register
 * - XCVR_TSM_CTRL - Transceiver Sequence Manager Control
 * - XCVR_END_OF_SEQ - End of Sequence Control
 * - XCVR_TSM_OVRD0 - TSM Override 0
 * - XCVR_TSM_OVRD1 - TSM Override 1
 * - XCVR_TSM_OVRD2 - TSM Override 2
 * - XCVR_TSM_OVRD3 - TSM Override 3
 * - XCVR_PA_POWER - PA Power
 * - XCVR_PA_BIAS_TBL0 - PA Bias Table 0
 * - XCVR_PA_BIAS_TBL1 - PA Bias Table 1
 * - XCVR_RECYCLE_COUNT - Recycle Count Register
 * - XCVR_TSM_TIMING00 - TSM_TIMING00
 * - XCVR_TSM_TIMING01 - TSM_TIMING01
 * - XCVR_TSM_TIMING02 - TSM_TIMING02
 * - XCVR_TSM_TIMING03 - TSM_TIMING03
 * - XCVR_TSM_TIMING04 - TSM_TIMING04
 * - XCVR_TSM_TIMING05 - TSM_TIMING05
 * - XCVR_TSM_TIMING06 - TSM_TIMING06
 * - XCVR_TSM_TIMING07 - TSM_TIMING07
 * - XCVR_TSM_TIMING08 - TSM_TIMING08
 * - XCVR_TSM_TIMING09 - TSM_TIMING09
 * - XCVR_TSM_TIMING10 - TSM_TIMING10
 * - XCVR_TSM_TIMING11 - TSM_TIMING11
 * - XCVR_TSM_TIMING12 - TSM_TIMING12
 * - XCVR_TSM_TIMING13 - TSM_TIMING13
 * - XCVR_TSM_TIMING14 - TSM_TIMING14
 * - XCVR_TSM_TIMING15 - TSM_TIMING15
 * - XCVR_TSM_TIMING16 - TSM_TIMING16
 * - XCVR_TSM_TIMING17 - TSM_TIMING17
 * - XCVR_TSM_TIMING18 - TSM_TIMING18
 * - XCVR_TSM_TIMING19 - TSM_TIMING19
 * - XCVR_TSM_TIMING20 - TSM_TIMING20
 * - XCVR_TSM_TIMING21 - TSM_TIMING21
 * - XCVR_TSM_TIMING22 - TSM_TIMING22
 * - XCVR_TSM_TIMING23 - TSM_TIMING23
 * - XCVR_TSM_TIMING24 - TSM_TIMING24
 * - XCVR_TSM_TIMING25 - TSM_TIMING25
 * - XCVR_TSM_TIMING26 - TSM_TIMING26
 * - XCVR_TSM_TIMING27 - TSM_TIMING27
 * - XCVR_TSM_TIMING28 - TSM_TIMING28
 * - XCVR_TSM_TIMING29 - TSM_TIMING29
 * - XCVR_TSM_TIMING30 - TSM_TIMING30
 * - XCVR_TSM_TIMING31 - TSM_TIMING31
 * - XCVR_TSM_TIMING32 - TSM_TIMING32
 * - XCVR_TSM_TIMING33 - TSM_TIMING33
 * - XCVR_TSM_TIMING34 - TSM_TIMING34
 * - XCVR_TSM_TIMING35 - TSM_TIMING35
 * - XCVR_TSM_TIMING36 - TSM_TIMING36
 * - XCVR_TSM_TIMING37 - TSM_TIMING37
 * - XCVR_TSM_TIMING38 - TSM_TIMING38
 * - XCVR_TSM_TIMING39 - TSM_TIMING39
 * - XCVR_TSM_TIMING40 - TSM_TIMING40
 * - XCVR_TSM_TIMING41 - TSM_TIMING41
 * - XCVR_TSM_TIMING42 - TSM_TIMING42
 * - XCVR_TSM_TIMING43 - TSM_TIMING43
 * - XCVR_CORR_CTRL - CORR_CTRL
 * - XCVR_PN_TYPE - PN_TYPE
 * - XCVR_PN_CODE - PN_CODE
 * - XCVR_SYNC_CTRL - Sync Control
 * - XCVR_SNF_THR - SNF_THR
 * - XCVR_FAD_THR - FAD_THR
 * - XCVR_ZBDEM_AFC - ZBDEM_AFC
 * - XCVR_LPPS_CTRL - LPPS Control Register
 * - XCVR_ADC_CTRL - ADC Control
 * - XCVR_ADC_TUNE - ADC Tuning
 * - XCVR_ADC_ADJ - ADC Adjustment
 * - XCVR_ADC_REGS - ADC Regulators
 * - XCVR_ADC_TRIMS - ADC Regulator Trims
 * - XCVR_ADC_TEST_CTRL - ADC Test Control
 * - XCVR_BBF_CTRL - Baseband Filter Control
 * - XCVR_RX_ANA_CTRL - RX Analog Control
 * - XCVR_XTAL_CTRL - Crystal Oscillator Control Register 1
 * - XCVR_XTAL_CTRL2 - Crystal Oscillator Control Register 2
 * - XCVR_BGAP_CTRL - Bandgap Control
 * - XCVR_PLL_CTRL - PLL Control Register
 * - XCVR_PLL_CTRL2 - PLL Control Register 2
 * - XCVR_PLL_TEST_CTRL - PLL Test Control
 * - XCVR_QGEN_CTRL - QGEN Control
 * - XCVR_TCA_CTRL - TCA Control
 * - XCVR_TZA_CTRL - TZA Control
 * - XCVR_TX_ANA_CTRL - TX Analog Control
 * - XCVR_ANA_SPARE - Analog Spare
 */

#define XCVR_INSTANCE_COUNT (1U) /*!< Number of instances of the XCVR module. */
#define XCVR_IDX (0U) /*!< Instance number for XCVR. */

