RT-Thread/rt-thread/bsp/freescale/platform/devices/MKW30Z4/include/MKW30Z4_extension.h
/*******************************************************************************
 * XCVR_TX_DFT_MOD_PAT - TX DFT Modulation Pattern
 ******************************************************************************/

/*!
 * @brief XCVR_TX_DFT_MOD_PAT - TX DFT Modulation Pattern (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire XCVR_TX_DFT_MOD_PAT register
 */
/*@{*/
#define XCVR_RD_TX_DFT_MOD_PAT(base) (XCVR_TX_DFT_MOD_PAT_REG(base))
#define XCVR_WR_TX_DFT_MOD_PAT(base, value) (XCVR_TX_DFT_MOD_PAT_REG(base) = (value))
#define XCVR_RMW_TX_DFT_MOD_PAT(base, mask, value) (XCVR_WR_TX_DFT_MOD_PAT(base, (XCVR_RD_TX_DFT_MOD_PAT(base) & ~(mask)) | (value)))
#define XCVR_SET_TX_DFT_MOD_PAT(base, value) (BME_OR32(&XCVR_TX_DFT_MOD_PAT_REG(base), (uint32_t)(value)))
#define XCVR_CLR_TX_DFT_MOD_PAT(base, value) (BME_AND32(&XCVR_TX_DFT_MOD_PAT_REG(base), (uint32_t)(~(value))))
#define XCVR_TOG_TX_DFT_MOD_PAT(base, value) (BME_XOR32(&XCVR_TX_DFT_MOD_PAT_REG(base), (uint32_t)(value)))
/*@}*/

/*******************************************************************************
 * XCVR_TX_DFT_TONE_0_1 - TX DFT Tones 0 and 1
 ******************************************************************************/

/*!
 * @brief XCVR_TX_DFT_TONE_0_1 - TX DFT Tones 0 and 1 (RW)
 *
 * Reset value: 0x10000FFFU
 *
 * The DFT Tone Registers are used in DFT Tone modes to bypass the GFSK and FSK
 * Modulators and instead present the selected Tone to the PLL as a constant tone
 * modulation. The two's complement range of these little endian registers is
 * -4096 to 4095
 */
/*!
 * @name Constants and macros for entire XCVR_TX_DFT_TONE_0_1 register
 */
/*@{*/
#define XCVR_RD_TX_DFT_TONE_0_1(base) (XCVR_TX_DFT_TONE_0_1_REG(base))
#define XCVR_WR_TX_DFT_TONE_0_1(base, value) (XCVR_TX_DFT_TONE_0_1_REG(base) = (value))
#define XCVR_RMW_TX_DFT_TONE_0_1(base, mask, value) (XCVR_WR_TX_DFT_TONE_0_1(base, (XCVR_RD_TX_DFT_TONE_0_1(base) & ~(mask)) | (value)))
#define XCVR_SET_TX_DFT_TONE_0_1(base, value) (BME_OR32(&XCVR_TX_DFT_TONE_0_1_REG(base), (uint32_t)(value)))
#define XCVR_CLR_TX_DFT_TONE_0_1(base, value) (BME_AND32(&XCVR_TX_DFT_TONE_0_1_REG(base), (uint32_t)(~(value))))
#define XCVR_TOG_TX_DFT_TONE_0_1(base, value) (BME_XOR32(&XCVR_TX_DFT_TONE_0_1_REG(base), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual XCVR_TX_DFT_TONE_0_1 bitfields
 */

/*!
 * @name Register XCVR_TX_DFT_TONE_0_1, field DFT_TONE_1[12:0] (RW)
 *
 * This register is used to provide the modulation level in DFT Tone Modes. The
 * signed 12 bit value that is represented by this register is presented to the
 * PLL as the Baseband Frequency Word. The frequency result for this Tone will be
 * the value of this register times the PLL Low Port Modulator Frequency
 * Resolution; a typical value for the Frequency Resolution is 244.14 Hz.
 */
/*@{*/
/*! @brief Read current value of the XCVR_TX_DFT_TONE_0_1_DFT_TONE_1 field. */
#define XCVR_RD_TX_DFT_TONE_0_1_DFT_TONE_1(base) ((XCVR_TX_DFT_TONE_0_1_REG(base) & XCVR_TX_DFT_TONE_0_1_DFT_TONE_1_MASK) >> XCVR_TX_DFT_TONE_0_1_DFT_TONE_1_SHIFT)
#define XCVR_BRD_TX_DFT_TONE_0_1_DFT_TONE_1(base) (BME_UBFX32(&XCVR_TX_DFT_TONE_0_1_REG(base), XCVR_TX_DFT_TONE_0_1_DFT_TONE_1_SHIFT, XCVR_TX_DFT_TONE_0_1_DFT_TONE_1_WIDTH))

/*! @brief Set the DFT_TONE_1 field to a new value. */
#define XCVR_WR_TX_DFT_TONE_0_1_DFT_TONE_1(base, value) (XCVR_RMW_TX_DFT_TONE_0_1(base, XCVR_TX_DFT_TONE_0_1_DFT_TONE_1_MASK, XCVR_TX_DFT_TONE_0_1_DFT_TONE_1(value)))
#define XCVR_BWR_TX_DFT_TONE_0_1_DFT_TONE_1(base, value) (BME_BFI32(&XCVR_TX_DFT_TONE_0_1_REG(base), ((uint32_t)(value) << XCVR_TX_DFT_TONE_0_1_DFT_TONE_1_SHIFT), XCVR_TX_DFT_TONE_0_1_DFT_TONE_1_SHIFT, XCVR_TX_DFT_TONE_0_1_DFT_TONE_1_WIDTH))
/*@}*/

/*!
 * @name Register XCVR_TX_DFT_TONE_0_1, field DFT_TONE_0[28:16] (RW)
 *
 * This register is used to provide the modulation level in DFT Tone Modes. The
 * signed 12 bit value that is represented by this register is presented to the
 * PLL as the Baseband Frequency Word. The frequency result for this Tone will be
 * the value of this register times the PLL Low Port Modulator Frequency
 * Resolution; a typical value for the Frequency Resolution is 244.14 Hz.
 */
/*@{*/
/*! @brief Read current value of the XCVR_TX_DFT_TONE_0_1_DFT_TONE_0 field. */
#define XCVR_RD_TX_DFT_TONE_0_1_DFT_TONE_0(base) ((XCVR_TX_DFT_TONE_0_1_REG(base) & XCVR_TX_DFT_TONE_0_1_DFT_TONE_0_MASK) >> XCVR_TX_DFT_TONE_0_1_DFT_TONE_0_SHIFT)
#define XCVR_BRD_TX_DFT_TONE_0_1_DFT_TONE_0(base) (BME_UBFX32(&XCVR_TX_DFT_TONE_0_1_REG(base), XCVR_TX_DFT_TONE_0_1_DFT_TONE_0_SHIFT, XCVR_TX_DFT_TONE_0_1_DFT_TONE_0_WIDTH))

/*! @brief Set the DFT_TONE_0 field to a new value. */
#define XCVR_WR_TX_DFT_TONE_0_1_DFT_TONE_0(base, value) (XCVR_RMW_TX_DFT_TONE_0_1(base, XCVR_TX_DFT_TONE_0_1_DFT_TONE_0_MASK, XCVR_TX_DFT_TONE_0_1_DFT_TONE_0(value)))
#define XCVR_BWR_TX_DFT_TONE_0_1_DFT_TONE_0(base, value) (BME_BFI32(&XCVR_TX_DFT_TONE_0_1_REG(base), ((uint32_t)(value) << XCVR_TX_DFT_TONE_0_1_DFT_TONE_0_SHIFT), XCVR_TX_DFT_TONE_0_1_DFT_TONE_0_SHIFT, XCVR_TX_DFT_TONE_0_1_DFT_TONE_0_WIDTH))
/*@}*/

/*******************************************************************************
 * XCVR_TX_DFT_TONE_2_3 - TX DFT Tones 2 and 3
 ******************************************************************************/

/*!
 * @brief XCVR_TX_DFT_TONE_2_3 - TX DFT Tones 2 and 3 (RW)
 *
 * Reset value: 0x1E0001FFU
 *
 * The DFT Tone Registers are used in DFT Tone modes to bypass the GFSK and FSK
 * Modulators and instead present the selected Tone to the PLL as a constant tone
 * modulation. The two's complement range of these little endian registers is
 * -4096 to 4095
 */
/*!
 * @name Constants and macros for entire XCVR_TX_DFT_TONE_2_3 register
 */
/*@{*/
#define XCVR_RD_TX_DFT_TONE_2_3(base) (XCVR_TX_DFT_TONE_2_3_REG(base))
#define XCVR_WR_TX_DFT_TONE_2_3(base, value) (XCVR_TX_DFT_TONE_2_3_REG(base) = (value))
#define XCVR_RMW_TX_DFT_TONE_2_3(base, mask, value) (XCVR_WR_TX_DFT_TONE_2_3(base, (XCVR_RD_TX_DFT_TONE_2_3(base) & ~(mask)) | (value)))
#define XCVR_SET_TX_DFT_TONE_2_3(base, value) (BME_OR32(&XCVR_TX_DFT_TONE_2_3_REG(base), (uint32_t)(value)))
#define XCVR_CLR_TX_DFT_TONE_2_3(base, value) (BME_AND32(&XCVR_TX_DFT_TONE_2_3_REG(base), (uint32_t)(~(value))))
#define XCVR_TOG_TX_DFT_TONE_2_3(base, value) (BME_XOR32(&XCVR_TX_DFT_TONE_2_3_REG(base), (uint32_t)(value)))
/*@}*/

