RT-Thread/rt-thread/bsp/freescale/platform/devices/MKW30Z4/include/MKW30Z4_extension.h
/*******************************************************************************
 * XCVR_SOFT_RESET - Soft Reset
 ******************************************************************************/

/*!
 * @brief XCVR_SOFT_RESET - Soft Reset (ROZ)
 *
 * Reset value: 0x00000000U
 *
 * Transceiver Soft Reset Note: Register not currently implemented.
 */
/*!
 * @name Constants and macros for entire XCVR_SOFT_RESET register
 */
/*@{*/
#define XCVR_RD_SOFT_RESET(base) (XCVR_SOFT_RESET_REG(base))
/*@}*/

/*******************************************************************************
 * XCVR_OVERWRITE_VER - Overwrite Version
 ******************************************************************************/

/*!
 * @brief XCVR_OVERWRITE_VER - Overwrite Version (RW)
 *
 * Reset value: 0x00000000U
 *
 * The Overwrite Version allows software to store a version number of trim and
 * calibration values which are used to overwrite the chip default values in the
 * registers. Typically, software would perform the overwrite of the defaults in
 * transceiver registers and then write the version number from the file
 * containing the overwrite values into this register. This register has no hardware
 * connections, it is simply a designated storage location for a version number.
 */
/*!
 * @name Constants and macros for entire XCVR_OVERWRITE_VER register
 */
/*@{*/
#define XCVR_RD_OVERWRITE_VER(base) (XCVR_OVERWRITE_VER_REG(base))
#define XCVR_WR_OVERWRITE_VER(base, value) (XCVR_OVERWRITE_VER_REG(base) = (value))
#define XCVR_RMW_OVERWRITE_VER(base, mask, value) (XCVR_WR_OVERWRITE_VER(base, (XCVR_RD_OVERWRITE_VER(base) & ~(mask)) | (value)))
#define XCVR_SET_OVERWRITE_VER(base, value) (BME_OR32(&XCVR_OVERWRITE_VER_REG(base), (uint32_t)(value)))
#define XCVR_CLR_OVERWRITE_VER(base, value) (BME_AND32(&XCVR_OVERWRITE_VER_REG(base), (uint32_t)(~(value))))
#define XCVR_TOG_OVERWRITE_VER(base, value) (BME_XOR32(&XCVR_OVERWRITE_VER_REG(base), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual XCVR_OVERWRITE_VER bitfields
 */

/*!
 * @name Register XCVR_OVERWRITE_VER, field OVERWRITE_VER[7:0] (RW)
 *
 * Points to the version number of the overwrites.h file used to initialize the
 * device; can be used by software to identify a version-controlled set of
 * non-default values to be written into the transceiver's register map.
 */
/*@{*/
/*! @brief Read current value of the XCVR_OVERWRITE_VER_OVERWRITE_VER field. */
#define XCVR_RD_OVERWRITE_VER_OVERWRITE_VER(base) ((XCVR_OVERWRITE_VER_REG(base) & XCVR_OVERWRITE_VER_OVERWRITE_VER_MASK) >> XCVR_OVERWRITE_VER_OVERWRITE_VER_SHIFT)
#define XCVR_BRD_OVERWRITE_VER_OVERWRITE_VER(base) (BME_UBFX32(&XCVR_OVERWRITE_VER_REG(base), XCVR_OVERWRITE_VER_OVERWRITE_VER_SHIFT, XCVR_OVERWRITE_VER_OVERWRITE_VER_WIDTH))

/*! @brief Set the OVERWRITE_VER field to a new value. */
#define XCVR_WR_OVERWRITE_VER_OVERWRITE_VER(base, value) (XCVR_RMW_OVERWRITE_VER(base, XCVR_OVERWRITE_VER_OVERWRITE_VER_MASK, XCVR_OVERWRITE_VER_OVERWRITE_VER(value)))
#define XCVR_BWR_OVERWRITE_VER_OVERWRITE_VER(base, value) (BME_BFI32(&XCVR_OVERWRITE_VER_REG(base), ((uint32_t)(value) << XCVR_OVERWRITE_VER_OVERWRITE_VER_SHIFT), XCVR_OVERWRITE_VER_OVERWRITE_VER_SHIFT, XCVR_OVERWRITE_VER_OVERWRITE_VER_WIDTH))
/*@}*/

/*******************************************************************************
 * XCVR_DMA_CTRL - DMA Control
 ******************************************************************************/

/*!
 * @brief XCVR_DMA_CTRL - DMA Control (RW)
 *
 * Reset value: 0x00000000U
 *
 * Transceiver DMA per-channel enable register. Transceiver DMA is intended for
 * engineering evaluation only. If DMA_I_EN and DMA_Q_EN are both set, I channel
 * samples appear in register field DMA_DATA[DMA_DATA_11_0] (lower halfword), and
 * Q channel samples appears in DMA_DATA[DMA_DATA_27_16] (upper halfword).
 */
/*!
 * @name Constants and macros for entire XCVR_DMA_CTRL register
 */
/*@{*/
#define XCVR_RD_DMA_CTRL(base)   (XCVR_DMA_CTRL_REG(base))
#define XCVR_WR_DMA_CTRL(base, value) (XCVR_DMA_CTRL_REG(base) = (value))
#define XCVR_RMW_DMA_CTRL(base, mask, value) (XCVR_WR_DMA_CTRL(base, (XCVR_RD_DMA_CTRL(base) & ~(mask)) | (value)))
#define XCVR_SET_DMA_CTRL(base, value) (BME_OR32(&XCVR_DMA_CTRL_REG(base), (uint32_t)(value)))
#define XCVR_CLR_DMA_CTRL(base, value) (BME_AND32(&XCVR_DMA_CTRL_REG(base), (uint32_t)(~(value))))
#define XCVR_TOG_DMA_CTRL(base, value) (BME_XOR32(&XCVR_DMA_CTRL_REG(base), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual XCVR_DMA_CTRL bitfields
 */

/*!
 * @name Register XCVR_DMA_CTRL, field DMA_I_EN[0] (RW)
 *
 * DMA I Enable
 *
 * Values:
 * - 0b0 - Transceiver I channel DMA disabled.
 * - 0b1 - Enable the transceiver DMA engine to store RX_DIG I channel outputs
 *     to system memory.
 */
/*@{*/
/*! @brief Read current value of the XCVR_DMA_CTRL_DMA_I_EN field. */
#define XCVR_RD_DMA_CTRL_DMA_I_EN(base) ((XCVR_DMA_CTRL_REG(base) & XCVR_DMA_CTRL_DMA_I_EN_MASK) >> XCVR_DMA_CTRL_DMA_I_EN_SHIFT)
#define XCVR_BRD_DMA_CTRL_DMA_I_EN(base) (BME_UBFX32(&XCVR_DMA_CTRL_REG(base), XCVR_DMA_CTRL_DMA_I_EN_SHIFT, XCVR_DMA_CTRL_DMA_I_EN_WIDTH))

/*! @brief Set the DMA_I_EN field to a new value. */
#define XCVR_WR_DMA_CTRL_DMA_I_EN(base, value) (XCVR_RMW_DMA_CTRL(base, XCVR_DMA_CTRL_DMA_I_EN_MASK, XCVR_DMA_CTRL_DMA_I_EN(value)))
#define XCVR_BWR_DMA_CTRL_DMA_I_EN(base, value) (BME_BFI32(&XCVR_DMA_CTRL_REG(base), ((uint32_t)(value) << XCVR_DMA_CTRL_DMA_I_EN_SHIFT), XCVR_DMA_CTRL_DMA_I_EN_SHIFT, XCVR_DMA_CTRL_DMA_I_EN_WIDTH))
/*@}*/

/*!
 * @name Register XCVR_DMA_CTRL, field DMA_Q_EN[1] (RW)
 *
 * DMA Q Enable
 *
 * Values:
 * - 0b0 - Transceiver Q channel DMA disabled.
 * - 0b1 - Enable the transceiver DMA engine to store RX_DIG Q channel outputs
 *     to system memory.
 */
/*@{*/
/*! @brief Read current value of the XCVR_DMA_CTRL_DMA_Q_EN field. */
#define XCVR_RD_DMA_CTRL_DMA_Q_EN(base) ((XCVR_DMA_CTRL_REG(base) & XCVR_DMA_CTRL_DMA_Q_EN_MASK) >> XCVR_DMA_CTRL_DMA_Q_EN_SHIFT)
#define XCVR_BRD_DMA_CTRL_DMA_Q_EN(base) (BME_UBFX32(&XCVR_DMA_CTRL_REG(base), XCVR_DMA_CTRL_DMA_Q_EN_SHIFT, XCVR_DMA_CTRL_DMA_Q_EN_WIDTH))

