RT-Thread/rt-thread/bsp/freescale/platform/devices/MKW30Z4/include/MKW30Z4_extension.h
/*! @brief Set the RX_MODE_OVRD_EN field to a new value. */
#define XCVR_WR_TSM_OVRD3_RX_MODE_OVRD_EN(base, value) (XCVR_RMW_TSM_OVRD3(base, XCVR_TSM_OVRD3_RX_MODE_OVRD_EN_MASK, XCVR_TSM_OVRD3_RX_MODE_OVRD_EN(value)))
#define XCVR_BWR_TSM_OVRD3_RX_MODE_OVRD_EN(base, value) (BME_BFI32(&XCVR_TSM_OVRD3_REG(base), ((uint32_t)(value) << XCVR_TSM_OVRD3_RX_MODE_OVRD_EN_SHIFT), XCVR_TSM_OVRD3_RX_MODE_OVRD_EN_SHIFT, XCVR_TSM_OVRD3_RX_MODE_OVRD_EN_WIDTH))
/*@}*/

/*!
 * @name Register XCVR_TSM_OVRD3, field RX_MODE_OVRD[11] (RW)
 *
 * When RX_MODE_OVRD_EN=1, this value overrides the mission mode state of the
 * signal "rx_mode". This bit is ignored when RX_MODE_OVRD_EN==0.
 */
/*@{*/
/*! @brief Read current value of the XCVR_TSM_OVRD3_RX_MODE_OVRD field. */
#define XCVR_RD_TSM_OVRD3_RX_MODE_OVRD(base) ((XCVR_TSM_OVRD3_REG(base) & XCVR_TSM_OVRD3_RX_MODE_OVRD_MASK) >> XCVR_TSM_OVRD3_RX_MODE_OVRD_SHIFT)
#define XCVR_BRD_TSM_OVRD3_RX_MODE_OVRD(base) (BME_UBFX32(&XCVR_TSM_OVRD3_REG(base), XCVR_TSM_OVRD3_RX_MODE_OVRD_SHIFT, XCVR_TSM_OVRD3_RX_MODE_OVRD_WIDTH))

/*! @brief Set the RX_MODE_OVRD field to a new value. */
#define XCVR_WR_TSM_OVRD3_RX_MODE_OVRD(base, value) (XCVR_RMW_TSM_OVRD3(base, XCVR_TSM_OVRD3_RX_MODE_OVRD_MASK, XCVR_TSM_OVRD3_RX_MODE_OVRD(value)))
#define XCVR_BWR_TSM_OVRD3_RX_MODE_OVRD(base, value) (BME_BFI32(&XCVR_TSM_OVRD3_REG(base), ((uint32_t)(value) << XCVR_TSM_OVRD3_RX_MODE_OVRD_SHIFT), XCVR_TSM_OVRD3_RX_MODE_OVRD_SHIFT, XCVR_TSM_OVRD3_RX_MODE_OVRD_WIDTH))
/*@}*/

/*******************************************************************************
 * XCVR_PA_POWER - PA Power
 ******************************************************************************/

/*!
 * @brief XCVR_PA_POWER - PA Power (RW)
 *
 * Reset value: 0x00000000U
 *
 * This contents of this register are used as PA target power when
 * XCVR_CTRL[TGT_PWR_SRC] = 00.
 */
/*!
 * @name Constants and macros for entire XCVR_PA_POWER register
 */
/*@{*/
#define XCVR_RD_PA_POWER(base)   (XCVR_PA_POWER_REG(base))
#define XCVR_WR_PA_POWER(base, value) (XCVR_PA_POWER_REG(base) = (value))
#define XCVR_RMW_PA_POWER(base, mask, value) (XCVR_WR_PA_POWER(base, (XCVR_RD_PA_POWER(base) & ~(mask)) | (value)))
#define XCVR_SET_PA_POWER(base, value) (BME_OR32(&XCVR_PA_POWER_REG(base), (uint32_t)(value)))
#define XCVR_CLR_PA_POWER(base, value) (BME_AND32(&XCVR_PA_POWER_REG(base), (uint32_t)(~(value))))
#define XCVR_TOG_PA_POWER(base, value) (BME_XOR32(&XCVR_PA_POWER_REG(base), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual XCVR_PA_POWER bitfields
 */

/*!
 * @name Register XCVR_PA_POWER, field PA_POWER[3:0] (RW)
 *
 * PA Target Power
 */
/*@{*/
/*! @brief Read current value of the XCVR_PA_POWER_PA_POWER field. */
#define XCVR_RD_PA_POWER_PA_POWER(base) ((XCVR_PA_POWER_REG(base) & XCVR_PA_POWER_PA_POWER_MASK) >> XCVR_PA_POWER_PA_POWER_SHIFT)
#define XCVR_BRD_PA_POWER_PA_POWER(base) (BME_UBFX32(&XCVR_PA_POWER_REG(base), XCVR_PA_POWER_PA_POWER_SHIFT, XCVR_PA_POWER_PA_POWER_WIDTH))

/*! @brief Set the PA_POWER field to a new value. */
#define XCVR_WR_PA_POWER_PA_POWER(base, value) (XCVR_RMW_PA_POWER(base, XCVR_PA_POWER_PA_POWER_MASK, XCVR_PA_POWER_PA_POWER(value)))
#define XCVR_BWR_PA_POWER_PA_POWER(base, value) (BME_BFI32(&XCVR_PA_POWER_REG(base), ((uint32_t)(value) << XCVR_PA_POWER_PA_POWER_SHIFT), XCVR_PA_POWER_PA_POWER_SHIFT, XCVR_PA_POWER_PA_POWER_WIDTH))
/*@}*/

/*******************************************************************************
 * XCVR_PA_BIAS_TBL0 - PA Bias Table 0
 ******************************************************************************/

/*!
 * @brief XCVR_PA_BIAS_TBL0 - PA Bias Table 0 (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire XCVR_PA_BIAS_TBL0 register
 */
/*@{*/
#define XCVR_RD_PA_BIAS_TBL0(base) (XCVR_PA_BIAS_TBL0_REG(base))
#define XCVR_WR_PA_BIAS_TBL0(base, value) (XCVR_PA_BIAS_TBL0_REG(base) = (value))
#define XCVR_RMW_PA_BIAS_TBL0(base, mask, value) (XCVR_WR_PA_BIAS_TBL0(base, (XCVR_RD_PA_BIAS_TBL0(base) & ~(mask)) | (value)))
#define XCVR_SET_PA_BIAS_TBL0(base, value) (BME_OR32(&XCVR_PA_BIAS_TBL0_REG(base), (uint32_t)(value)))
#define XCVR_CLR_PA_BIAS_TBL0(base, value) (BME_AND32(&XCVR_PA_BIAS_TBL0_REG(base), (uint32_t)(~(value))))
#define XCVR_TOG_PA_BIAS_TBL0(base, value) (BME_XOR32(&XCVR_PA_BIAS_TBL0_REG(base), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual XCVR_PA_BIAS_TBL0 bitfields
 */

/*!
 * @name Register XCVR_PA_BIAS_TBL0, field PA_BIAS0[3:0] (RW)
 *
 * If PA ramping is enabled (TSM_CTRL[PA_RAMP_SEL] > 00), the contents of this
 * register are presented to the PA during PA ramping, when TSM tx_en transitions
 * low to high, and then for the duration of the first ramp step. During PA ramp
 * down, the contents of this register are the PA power value during the final
 * ramp step. In both cases, PA_BIAS0 cannot exceed target power (enforced by PA
 * ramping logic). When PA ramping is enabled, the contents of PA_BIAS0 are also
 * presented to the PA during sequence-idle conditions.
 */
/*@{*/
/*! @brief Read current value of the XCVR_PA_BIAS_TBL0_PA_BIAS0 field. */
#define XCVR_RD_PA_BIAS_TBL0_PA_BIAS0(base) ((XCVR_PA_BIAS_TBL0_REG(base) & XCVR_PA_BIAS_TBL0_PA_BIAS0_MASK) >> XCVR_PA_BIAS_TBL0_PA_BIAS0_SHIFT)
#define XCVR_BRD_PA_BIAS_TBL0_PA_BIAS0(base) (BME_UBFX32(&XCVR_PA_BIAS_TBL0_REG(base), XCVR_PA_BIAS_TBL0_PA_BIAS0_SHIFT, XCVR_PA_BIAS_TBL0_PA_BIAS0_WIDTH))

/*! @brief Set the PA_BIAS0 field to a new value. */
#define XCVR_WR_PA_BIAS_TBL0_PA_BIAS0(base, value) (XCVR_RMW_PA_BIAS_TBL0(base, XCVR_PA_BIAS_TBL0_PA_BIAS0_MASK, XCVR_PA_BIAS_TBL0_PA_BIAS0(value)))
#define XCVR_BWR_PA_BIAS_TBL0_PA_BIAS0(base, value) (BME_BFI32(&XCVR_PA_BIAS_TBL0_REG(base), ((uint32_t)(value) << XCVR_PA_BIAS_TBL0_PA_BIAS0_SHIFT), XCVR_PA_BIAS_TBL0_PA_BIAS0_SHIFT, XCVR_PA_BIAS_TBL0_PA_BIAS0_WIDTH))
/*@}*/

/*!
 * @name Register XCVR_PA_BIAS_TBL0, field PA_BIAS1[11:8] (RW)
 *
 * If PA ramping is enabled (TSM_CTRL[PA_RAMP_SEL] > 00), the contents of this
 * register are presented to the PA during PA ramping, for the duration of the
 * second ramp step. During PA ramp down, the contents of this register are the PA
 * power value during the second-to-last ramp step. In both cases, PA_BIAS1 cannot
 * exceed target power (enforced by PA ramping logic).
 */
/*@{*/
/*! @brief Read current value of the XCVR_PA_BIAS_TBL0_PA_BIAS1 field. */
#define XCVR_RD_PA_BIAS_TBL0_PA_BIAS1(base) ((XCVR_PA_BIAS_TBL0_REG(base) & XCVR_PA_BIAS_TBL0_PA_BIAS1_MASK) >> XCVR_PA_BIAS_TBL0_PA_BIAS1_SHIFT)
#define XCVR_BRD_PA_BIAS_TBL0_PA_BIAS1(base) (BME_UBFX32(&XCVR_PA_BIAS_TBL0_REG(base), XCVR_PA_BIAS_TBL0_PA_BIAS1_SHIFT, XCVR_PA_BIAS_TBL0_PA_BIAS1_WIDTH))

/*! @brief Set the PA_BIAS1 field to a new value. */
#define XCVR_WR_PA_BIAS_TBL0_PA_BIAS1(base, value) (XCVR_RMW_PA_BIAS_TBL0(base, XCVR_PA_BIAS_TBL0_PA_BIAS1_MASK, XCVR_PA_BIAS_TBL0_PA_BIAS1(value)))
#define XCVR_BWR_PA_BIAS_TBL0_PA_BIAS1(base, value) (BME_BFI32(&XCVR_PA_BIAS_TBL0_REG(base), ((uint32_t)(value) << XCVR_PA_BIAS_TBL0_PA_BIAS1_SHIFT), XCVR_PA_BIAS_TBL0_PA_BIAS1_SHIFT, XCVR_PA_BIAS_TBL0_PA_BIAS1_WIDTH))
/*@}*/

/*!
 * @name Register XCVR_PA_BIAS_TBL0, field PA_BIAS2[19:16] (RW)
 *
 * If PA ramping is enabled (TSM_CTRL[PA_RAMP_EN] > 00), the contents of this
 * register are presented to the PA during PA ramping, for the duration of the
 * third ramp step. During PA ramp down, the contents of this register are the PA
 * power value during the third-to-last ramp step. In both cases, PA_BIAS2 cannot
 * exceed target power (enforced by PA ramping logic).
 */
/*@{*/
/*! @brief Read current value of the XCVR_PA_BIAS_TBL0_PA_BIAS2 field. */
#define XCVR_RD_PA_BIAS_TBL0_PA_BIAS2(base) ((XCVR_PA_BIAS_TBL0_REG(base) & XCVR_PA_BIAS_TBL0_PA_BIAS2_MASK) >> XCVR_PA_BIAS_TBL0_PA_BIAS2_SHIFT)
#define XCVR_BRD_PA_BIAS_TBL0_PA_BIAS2(base) (BME_UBFX32(&XCVR_PA_BIAS_TBL0_REG(base), XCVR_PA_BIAS_TBL0_PA_BIAS2_SHIFT, XCVR_PA_BIAS_TBL0_PA_BIAS2_WIDTH))

/*! @brief Set the PA_BIAS2 field to a new value. */
#define XCVR_WR_PA_BIAS_TBL0_PA_BIAS2(base, value) (XCVR_RMW_PA_BIAS_TBL0(base, XCVR_PA_BIAS_TBL0_PA_BIAS2_MASK, XCVR_PA_BIAS_TBL0_PA_BIAS2(value)))
#define XCVR_BWR_PA_BIAS_TBL0_PA_BIAS2(base, value) (BME_BFI32(&XCVR_PA_BIAS_TBL0_REG(base), ((uint32_t)(value) << XCVR_PA_BIAS_TBL0_PA_BIAS2_SHIFT), XCVR_PA_BIAS_TBL0_PA_BIAS2_SHIFT, XCVR_PA_BIAS_TBL0_PA_BIAS2_WIDTH))
/*@}*/

/*!
 * @name Register XCVR_PA_BIAS_TBL0, field PA_BIAS3[27:24] (RW)
 *
 * If PA ramping is enabled (TSM_CTRL[PA_RAMP_EN] > 00), the contents of this
 * register are presented to the PA during PA ramping, for the duration of the
 * fourth ramp step. During PA ramp down, the contents of this register are the PA
 * power value during the fourth-to-last ramp step. In both cases, PA_BIAS3 cannot
 * exceed target power (enforced by PA ramping logic).
 */
/*@{*/
/*! @brief Read current value of the XCVR_PA_BIAS_TBL0_PA_BIAS3 field. */
#define XCVR_RD_PA_BIAS_TBL0_PA_BIAS3(base) ((XCVR_PA_BIAS_TBL0_REG(base) & XCVR_PA_BIAS_TBL0_PA_BIAS3_MASK) >> XCVR_PA_BIAS_TBL0_PA_BIAS3_SHIFT)
#define XCVR_BRD_PA_BIAS_TBL0_PA_BIAS3(base) (BME_UBFX32(&XCVR_PA_BIAS_TBL0_REG(base), XCVR_PA_BIAS_TBL0_PA_BIAS3_SHIFT, XCVR_PA_BIAS_TBL0_PA_BIAS3_WIDTH))

/*! @brief Set the PA_BIAS3 field to a new value. */
#define XCVR_WR_PA_BIAS_TBL0_PA_BIAS3(base, value) (XCVR_RMW_PA_BIAS_TBL0(base, XCVR_PA_BIAS_TBL0_PA_BIAS3_MASK, XCVR_PA_BIAS_TBL0_PA_BIAS3(value)))
#define XCVR_BWR_PA_BIAS_TBL0_PA_BIAS3(base, value) (BME_BFI32(&XCVR_PA_BIAS_TBL0_REG(base), ((uint32_t)(value) << XCVR_PA_BIAS_TBL0_PA_BIAS3_SHIFT), XCVR_PA_BIAS_TBL0_PA_BIAS3_SHIFT, XCVR_PA_BIAS_TBL0_PA_BIAS3_WIDTH))
/*@}*/

