RT-Thread/rt-thread/bsp/freescale/platform/devices/MKW30Z4/include/MKW30Z4_extension.h
/*******************************************************************************
 * XCVR_PA_BIAS_TBL1 - PA Bias Table 1
 ******************************************************************************/

/*!
 * @brief XCVR_PA_BIAS_TBL1 - PA Bias Table 1 (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire XCVR_PA_BIAS_TBL1 register
 */
/*@{*/
#define XCVR_RD_PA_BIAS_TBL1(base) (XCVR_PA_BIAS_TBL1_REG(base))
#define XCVR_WR_PA_BIAS_TBL1(base, value) (XCVR_PA_BIAS_TBL1_REG(base) = (value))
#define XCVR_RMW_PA_BIAS_TBL1(base, mask, value) (XCVR_WR_PA_BIAS_TBL1(base, (XCVR_RD_PA_BIAS_TBL1(base) & ~(mask)) | (value)))
#define XCVR_SET_PA_BIAS_TBL1(base, value) (BME_OR32(&XCVR_PA_BIAS_TBL1_REG(base), (uint32_t)(value)))
#define XCVR_CLR_PA_BIAS_TBL1(base, value) (BME_AND32(&XCVR_PA_BIAS_TBL1_REG(base), (uint32_t)(~(value))))
#define XCVR_TOG_PA_BIAS_TBL1(base, value) (BME_XOR32(&XCVR_PA_BIAS_TBL1_REG(base), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual XCVR_PA_BIAS_TBL1 bitfields
 */

/*!
 * @name Register XCVR_PA_BIAS_TBL1, field PA_BIAS4[3:0] (RW)
 *
 * If PA ramping is enabled (TSM_CTRL[PA_RAMP_EN] > 00), the contents of this
 * register are presented to the PA during PA ramping, for the duration of the
 * fifth ramp step. During PA ramp down, the contents of this register are the PA
 * power value during the fifth-to-last ramp step. In both cases, PA_BIAS4 cannot
 * exceed target power (enforced by PA ramping logic).
 */
/*@{*/
/*! @brief Read current value of the XCVR_PA_BIAS_TBL1_PA_BIAS4 field. */
#define XCVR_RD_PA_BIAS_TBL1_PA_BIAS4(base) ((XCVR_PA_BIAS_TBL1_REG(base) & XCVR_PA_BIAS_TBL1_PA_BIAS4_MASK) >> XCVR_PA_BIAS_TBL1_PA_BIAS4_SHIFT)
#define XCVR_BRD_PA_BIAS_TBL1_PA_BIAS4(base) (BME_UBFX32(&XCVR_PA_BIAS_TBL1_REG(base), XCVR_PA_BIAS_TBL1_PA_BIAS4_SHIFT, XCVR_PA_BIAS_TBL1_PA_BIAS4_WIDTH))

/*! @brief Set the PA_BIAS4 field to a new value. */
#define XCVR_WR_PA_BIAS_TBL1_PA_BIAS4(base, value) (XCVR_RMW_PA_BIAS_TBL1(base, XCVR_PA_BIAS_TBL1_PA_BIAS4_MASK, XCVR_PA_BIAS_TBL1_PA_BIAS4(value)))
#define XCVR_BWR_PA_BIAS_TBL1_PA_BIAS4(base, value) (BME_BFI32(&XCVR_PA_BIAS_TBL1_REG(base), ((uint32_t)(value) << XCVR_PA_BIAS_TBL1_PA_BIAS4_SHIFT), XCVR_PA_BIAS_TBL1_PA_BIAS4_SHIFT, XCVR_PA_BIAS_TBL1_PA_BIAS4_WIDTH))
/*@}*/

/*!
 * @name Register XCVR_PA_BIAS_TBL1, field PA_BIAS5[11:8] (RW)
 *
 * If PA ramping is enabled (TSM_CTRL[PA_RAMP_EN] > 00), the contents of this
 * register are presented to the PA during PA ramping, for the duration of the
 * sixth ramp step. During PA ramp down, the contents of this register are the PA
 * power value during the sixth-to-last ramp step. In both cases, PA_BIAS5 cannot
 * exceed target power (enforced by PA ramping logic).
 */
/*@{*/
/*! @brief Read current value of the XCVR_PA_BIAS_TBL1_PA_BIAS5 field. */
#define XCVR_RD_PA_BIAS_TBL1_PA_BIAS5(base) ((XCVR_PA_BIAS_TBL1_REG(base) & XCVR_PA_BIAS_TBL1_PA_BIAS5_MASK) >> XCVR_PA_BIAS_TBL1_PA_BIAS5_SHIFT)
#define XCVR_BRD_PA_BIAS_TBL1_PA_BIAS5(base) (BME_UBFX32(&XCVR_PA_BIAS_TBL1_REG(base), XCVR_PA_BIAS_TBL1_PA_BIAS5_SHIFT, XCVR_PA_BIAS_TBL1_PA_BIAS5_WIDTH))

/*! @brief Set the PA_BIAS5 field to a new value. */
#define XCVR_WR_PA_BIAS_TBL1_PA_BIAS5(base, value) (XCVR_RMW_PA_BIAS_TBL1(base, XCVR_PA_BIAS_TBL1_PA_BIAS5_MASK, XCVR_PA_BIAS_TBL1_PA_BIAS5(value)))
#define XCVR_BWR_PA_BIAS_TBL1_PA_BIAS5(base, value) (BME_BFI32(&XCVR_PA_BIAS_TBL1_REG(base), ((uint32_t)(value) << XCVR_PA_BIAS_TBL1_PA_BIAS5_SHIFT), XCVR_PA_BIAS_TBL1_PA_BIAS5_SHIFT, XCVR_PA_BIAS_TBL1_PA_BIAS5_WIDTH))
/*@}*/

/*!
 * @name Register XCVR_PA_BIAS_TBL1, field PA_BIAS6[19:16] (RW)
 *
 * If PA ramping is enabled (TSM_CTRL[PA_RAMP_EN] > 00), the contents of this
 * register are presented to the PA during PA ramping, for the duration of the
 * seventh ramp step. During PA ramp down, the contents of this register are the PA
 * power value during the seventh-to-last ramp step. In both cases, PA_BIAS6
 * cannot exceed target power (enforced by PA ramping logic).
 */
/*@{*/
/*! @brief Read current value of the XCVR_PA_BIAS_TBL1_PA_BIAS6 field. */
#define XCVR_RD_PA_BIAS_TBL1_PA_BIAS6(base) ((XCVR_PA_BIAS_TBL1_REG(base) & XCVR_PA_BIAS_TBL1_PA_BIAS6_MASK) >> XCVR_PA_BIAS_TBL1_PA_BIAS6_SHIFT)
#define XCVR_BRD_PA_BIAS_TBL1_PA_BIAS6(base) (BME_UBFX32(&XCVR_PA_BIAS_TBL1_REG(base), XCVR_PA_BIAS_TBL1_PA_BIAS6_SHIFT, XCVR_PA_BIAS_TBL1_PA_BIAS6_WIDTH))

/*! @brief Set the PA_BIAS6 field to a new value. */
#define XCVR_WR_PA_BIAS_TBL1_PA_BIAS6(base, value) (XCVR_RMW_PA_BIAS_TBL1(base, XCVR_PA_BIAS_TBL1_PA_BIAS6_MASK, XCVR_PA_BIAS_TBL1_PA_BIAS6(value)))
#define XCVR_BWR_PA_BIAS_TBL1_PA_BIAS6(base, value) (BME_BFI32(&XCVR_PA_BIAS_TBL1_REG(base), ((uint32_t)(value) << XCVR_PA_BIAS_TBL1_PA_BIAS6_SHIFT), XCVR_PA_BIAS_TBL1_PA_BIAS6_SHIFT, XCVR_PA_BIAS_TBL1_PA_BIAS6_WIDTH))
/*@}*/

/*!
 * @name Register XCVR_PA_BIAS_TBL1, field PA_BIAS7[27:24] (RW)
 *
 * If PA ramping is enabled (TSM_CTRL[PA_RAMP_EN] > 00), the contents of this
 * register are presented to the PA during PA ramping, for the duration of the
 * eighth (final) ramp step. During PA ramp down, the contents of this register are
 * the PA power value during the eighth-to-last (first) ramp step. In both cases,
 * PA_BIAS7 cannot exceed target power (enforced by PA ramping logic).
 */
/*@{*/
/*! @brief Read current value of the XCVR_PA_BIAS_TBL1_PA_BIAS7 field. */
#define XCVR_RD_PA_BIAS_TBL1_PA_BIAS7(base) ((XCVR_PA_BIAS_TBL1_REG(base) & XCVR_PA_BIAS_TBL1_PA_BIAS7_MASK) >> XCVR_PA_BIAS_TBL1_PA_BIAS7_SHIFT)
#define XCVR_BRD_PA_BIAS_TBL1_PA_BIAS7(base) (BME_UBFX32(&XCVR_PA_BIAS_TBL1_REG(base), XCVR_PA_BIAS_TBL1_PA_BIAS7_SHIFT, XCVR_PA_BIAS_TBL1_PA_BIAS7_WIDTH))

/*! @brief Set the PA_BIAS7 field to a new value. */
#define XCVR_WR_PA_BIAS_TBL1_PA_BIAS7(base, value) (XCVR_RMW_PA_BIAS_TBL1(base, XCVR_PA_BIAS_TBL1_PA_BIAS7_MASK, XCVR_PA_BIAS_TBL1_PA_BIAS7(value)))
#define XCVR_BWR_PA_BIAS_TBL1_PA_BIAS7(base, value) (BME_BFI32(&XCVR_PA_BIAS_TBL1_REG(base), ((uint32_t)(value) << XCVR_PA_BIAS_TBL1_PA_BIAS7_SHIFT), XCVR_PA_BIAS_TBL1_PA_BIAS7_SHIFT, XCVR_PA_BIAS_TBL1_PA_BIAS7_WIDTH))
/*@}*/

