RT-Thread/rt-thread/bsp/freescale/platform/devices/MKW30Z4/include/MKW30Z4_extension.h
/*******************************************************************************
 * XCVR_RECYCLE_COUNT - Recycle Count Register
 ******************************************************************************/

/*!
 * @brief XCVR_RECYCLE_COUNT - Recycle Count Register (RW)
 *
 * Reset value: 0x00000826U
 */
/*!
 * @name Constants and macros for entire XCVR_RECYCLE_COUNT register
 */
/*@{*/
#define XCVR_RD_RECYCLE_COUNT(base) (XCVR_RECYCLE_COUNT_REG(base))
#define XCVR_WR_RECYCLE_COUNT(base, value) (XCVR_RECYCLE_COUNT_REG(base) = (value))
#define XCVR_RMW_RECYCLE_COUNT(base, mask, value) (XCVR_WR_RECYCLE_COUNT(base, (XCVR_RD_RECYCLE_COUNT(base) & ~(mask)) | (value)))
#define XCVR_SET_RECYCLE_COUNT(base, value) (BME_OR32(&XCVR_RECYCLE_COUNT_REG(base), (uint32_t)(value)))
#define XCVR_CLR_RECYCLE_COUNT(base, value) (BME_AND32(&XCVR_RECYCLE_COUNT_REG(base), (uint32_t)(~(value))))
#define XCVR_TOG_RECYCLE_COUNT(base, value) (BME_XOR32(&XCVR_RECYCLE_COUNT_REG(base), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual XCVR_RECYCLE_COUNT bitfields
 */

/*!
 * @name Register XCVR_RECYCLE_COUNT, field RECYCLE_COUNT0[7:0] (RW)
 *
 * The RECYCLE_COUNT0[7:0] register determines the TSM count value to which the
 * TSM "recycles" when the Zigbee Sequence Manager (ZSM) state "RX_CYC" is
 * reached and the ZSM asserts tsm_recycle[0] to TSM. This register also determines the
 * TSM count value to which the TSM recycles when the ZSM state RX_CCCA is
 * reached because tsm_recycle[0] is also asserted in this state. The intention is for
 * this register to be programmed to a TSM count value such that the TSM
 * re-asserts its "rx_init" output, but there are no restrictions on programming this
 * register. An RX recycle is a command from ZSM to TSM to jump from the TSM ON
 * phase back to a programmable point in the WARMUP phase, and resume counting from
 * there. A recycle will result from the reception of a packet with bad CRC or
 * one which fails packet-filtering rules, or the end of a CCA operation in
 * Continuous CCA mode which results in a channel indicating "busy".
 */
/*@{*/
/*! @brief Read current value of the XCVR_RECYCLE_COUNT_RECYCLE_COUNT0 field. */
#define XCVR_RD_RECYCLE_COUNT_RECYCLE_COUNT0(base) ((XCVR_RECYCLE_COUNT_REG(base) & XCVR_RECYCLE_COUNT_RECYCLE_COUNT0_MASK) >> XCVR_RECYCLE_COUNT_RECYCLE_COUNT0_SHIFT)
#define XCVR_BRD_RECYCLE_COUNT_RECYCLE_COUNT0(base) (BME_UBFX32(&XCVR_RECYCLE_COUNT_REG(base), XCVR_RECYCLE_COUNT_RECYCLE_COUNT0_SHIFT, XCVR_RECYCLE_COUNT_RECYCLE_COUNT0_WIDTH))

/*! @brief Set the RECYCLE_COUNT0 field to a new value. */
#define XCVR_WR_RECYCLE_COUNT_RECYCLE_COUNT0(base, value) (XCVR_RMW_RECYCLE_COUNT(base, XCVR_RECYCLE_COUNT_RECYCLE_COUNT0_MASK, XCVR_RECYCLE_COUNT_RECYCLE_COUNT0(value)))
#define XCVR_BWR_RECYCLE_COUNT_RECYCLE_COUNT0(base, value) (BME_BFI32(&XCVR_RECYCLE_COUNT_REG(base), ((uint32_t)(value) << XCVR_RECYCLE_COUNT_RECYCLE_COUNT0_SHIFT), XCVR_RECYCLE_COUNT_RECYCLE_COUNT0_SHIFT, XCVR_RECYCLE_COUNT_RECYCLE_COUNT0_WIDTH))
/*@}*/

/*!
 * @name Register XCVR_RECYCLE_COUNT, field RECYCLE_COUNT1[15:8] (RW)
 *
 * The RECYCLE_COUNT1[7:0] register determines the TSM count value to which the
 * TSM "recycles" when the Zigbee Sequence Manager (ZSM) state "RX_PAN1" is
 * reached and the ZSM asserts tsm_recycle[1] to TSM. The intention is for this
 * register to be programmed to a TSM count value such that the TSM de-asserts, and
 * then re-asserts its "pll_dig_en" output, to effectuate a Dual PAN on-the-fly
 * channel change, but there are no restrictions on programming this register. An RX
 * recycle is a command from ZSM to TSM to jump from the TSM ON phase back to a
 * programmable point in the WARMUP phase, and resume counting from there. A
 * recycle will result from the expiration of the Dual PAN Dwell Timer, at which point
 * an RF-channel change is required. This necessitates the desassertion and
 * reassertion of pll_dig_en, hence the return to the WARMUP phase at the appropriate
 * point.
 */
/*@{*/
/*! @brief Read current value of the XCVR_RECYCLE_COUNT_RECYCLE_COUNT1 field. */
#define XCVR_RD_RECYCLE_COUNT_RECYCLE_COUNT1(base) ((XCVR_RECYCLE_COUNT_REG(base) & XCVR_RECYCLE_COUNT_RECYCLE_COUNT1_MASK) >> XCVR_RECYCLE_COUNT_RECYCLE_COUNT1_SHIFT)
#define XCVR_BRD_RECYCLE_COUNT_RECYCLE_COUNT1(base) (BME_UBFX32(&XCVR_RECYCLE_COUNT_REG(base), XCVR_RECYCLE_COUNT_RECYCLE_COUNT1_SHIFT, XCVR_RECYCLE_COUNT_RECYCLE_COUNT1_WIDTH))

/*! @brief Set the RECYCLE_COUNT1 field to a new value. */
#define XCVR_WR_RECYCLE_COUNT_RECYCLE_COUNT1(base, value) (XCVR_RMW_RECYCLE_COUNT(base, XCVR_RECYCLE_COUNT_RECYCLE_COUNT1_MASK, XCVR_RECYCLE_COUNT_RECYCLE_COUNT1(value)))
#define XCVR_BWR_RECYCLE_COUNT_RECYCLE_COUNT1(base, value) (BME_BFI32(&XCVR_RECYCLE_COUNT_REG(base), ((uint32_t)(value) << XCVR_RECYCLE_COUNT_RECYCLE_COUNT1_SHIFT), XCVR_RECYCLE_COUNT_RECYCLE_COUNT1_SHIFT, XCVR_RECYCLE_COUNT_RECYCLE_COUNT1_WIDTH))
/*@}*/

/*******************************************************************************
 * XCVR_TSM_TIMING00 - TSM_TIMING00
 ******************************************************************************/

/*!
 * @brief XCVR_TSM_TIMING00 - TSM_TIMING00 (RW)
 *
 * Reset value: 0x65006A00U
 *
 * This register contains the timing values to control the assertion and
 * deassertion times for both TX and RX sequences for the PLL_REG_EN TSM signal or
 * signal group.
 */
/*!
 * @name Constants and macros for entire XCVR_TSM_TIMING00 register
 */
/*@{*/
#define XCVR_RD_TSM_TIMING00(base) (XCVR_TSM_TIMING00_REG(base))
#define XCVR_WR_TSM_TIMING00(base, value) (XCVR_TSM_TIMING00_REG(base) = (value))
#define XCVR_RMW_TSM_TIMING00(base, mask, value) (XCVR_WR_TSM_TIMING00(base, (XCVR_RD_TSM_TIMING00(base) & ~(mask)) | (value)))
#define XCVR_SET_TSM_TIMING00(base, value) (BME_OR32(&XCVR_TSM_TIMING00_REG(base), (uint32_t)(value)))
#define XCVR_CLR_TSM_TIMING00(base, value) (BME_AND32(&XCVR_TSM_TIMING00_REG(base), (uint32_t)(~(value))))
#define XCVR_TOG_TSM_TIMING00(base, value) (BME_XOR32(&XCVR_TSM_TIMING00_REG(base), (uint32_t)(value)))
/*@}*/

