RT-Thread/rt-thread/bsp/freescale/platform/devices/MKW30Z4/include/MKW30Z4_extension.h
/*! @brief Set the XCVSEQ field to a new value. */
#define ZLL_WR_PHY_CTRL_XCVSEQ(base, value) (ZLL_RMW_PHY_CTRL(base, ZLL_PHY_CTRL_XCVSEQ_MASK, ZLL_PHY_CTRL_XCVSEQ(value)))
#define ZLL_BWR_PHY_CTRL_XCVSEQ(base, value) (BME_BFI32(&ZLL_PHY_CTRL_REG(base), ((uint32_t)(value) << ZLL_PHY_CTRL_XCVSEQ_SHIFT), ZLL_PHY_CTRL_XCVSEQ_SHIFT, ZLL_PHY_CTRL_XCVSEQ_WIDTH))
/*@}*/

/*!
 * @name Register ZLL_PHY_CTRL, field AUTOACK[3] (RW)
 *
 * Applies only to Sequence R and Sequence TR, ignored during other sequences
 *
 * Values:
 * - 0b0 - sequence manager will not follow a receive frame with a Tx Ack frame,
 *     under any conditions; the autosequence will terminate after the receive
 *     frame.
 * - 0b1 - sequence manager will follow a receive frame with an automatic
 *     hardware-generated Tx Ack frame, assuming other necessary conditions are met.
 */
/*@{*/
/*! @brief Read current value of the ZLL_PHY_CTRL_AUTOACK field. */
#define ZLL_RD_PHY_CTRL_AUTOACK(base) ((ZLL_PHY_CTRL_REG(base) & ZLL_PHY_CTRL_AUTOACK_MASK) >> ZLL_PHY_CTRL_AUTOACK_SHIFT)
#define ZLL_BRD_PHY_CTRL_AUTOACK(base) (BME_UBFX32(&ZLL_PHY_CTRL_REG(base), ZLL_PHY_CTRL_AUTOACK_SHIFT, ZLL_PHY_CTRL_AUTOACK_WIDTH))

/*! @brief Set the AUTOACK field to a new value. */
#define ZLL_WR_PHY_CTRL_AUTOACK(base, value) (ZLL_RMW_PHY_CTRL(base, ZLL_PHY_CTRL_AUTOACK_MASK, ZLL_PHY_CTRL_AUTOACK(value)))
#define ZLL_BWR_PHY_CTRL_AUTOACK(base, value) (BME_BFI32(&ZLL_PHY_CTRL_REG(base), ((uint32_t)(value) << ZLL_PHY_CTRL_AUTOACK_SHIFT), ZLL_PHY_CTRL_AUTOACK_SHIFT, ZLL_PHY_CTRL_AUTOACK_WIDTH))
/*@}*/

/*!
 * @name Register ZLL_PHY_CTRL, field RXACKRQD[4] (RW)
 *
 * Applies only to Sequence TR, ignored during all other sequences.
 *
 * Values:
 * - 0b0 - An ordinary receive frame (any type of frame) follows the transmit
 *     frame.
 * - 0b1 - A receive Ack frame is expected to follow the transmit frame (non-Ack
 *     frames are rejected).
 */
/*@{*/
/*! @brief Read current value of the ZLL_PHY_CTRL_RXACKRQD field. */
#define ZLL_RD_PHY_CTRL_RXACKRQD(base) ((ZLL_PHY_CTRL_REG(base) & ZLL_PHY_CTRL_RXACKRQD_MASK) >> ZLL_PHY_CTRL_RXACKRQD_SHIFT)
#define ZLL_BRD_PHY_CTRL_RXACKRQD(base) (BME_UBFX32(&ZLL_PHY_CTRL_REG(base), ZLL_PHY_CTRL_RXACKRQD_SHIFT, ZLL_PHY_CTRL_RXACKRQD_WIDTH))

/*! @brief Set the RXACKRQD field to a new value. */
#define ZLL_WR_PHY_CTRL_RXACKRQD(base, value) (ZLL_RMW_PHY_CTRL(base, ZLL_PHY_CTRL_RXACKRQD_MASK, ZLL_PHY_CTRL_RXACKRQD(value)))
#define ZLL_BWR_PHY_CTRL_RXACKRQD(base, value) (BME_BFI32(&ZLL_PHY_CTRL_REG(base), ((uint32_t)(value) << ZLL_PHY_CTRL_RXACKRQD_SHIFT), ZLL_PHY_CTRL_RXACKRQD_SHIFT, ZLL_PHY_CTRL_RXACKRQD_WIDTH))
/*@}*/

/*!
 * @name Register ZLL_PHY_CTRL, field CCABFRTX[5] (RW)
 *
 * Applies only to Sequences T and TR, ignored during all other sequences.
 *
 * Values:
 * - 0b0 - no CCA required, transmit operation begins immediately.
 * - 0b1 - at least one CCA measurement is required prior to the transmit
 *     operation (see also SLOTTED).
 */
/*@{*/
/*! @brief Read current value of the ZLL_PHY_CTRL_CCABFRTX field. */
#define ZLL_RD_PHY_CTRL_CCABFRTX(base) ((ZLL_PHY_CTRL_REG(base) & ZLL_PHY_CTRL_CCABFRTX_MASK) >> ZLL_PHY_CTRL_CCABFRTX_SHIFT)
#define ZLL_BRD_PHY_CTRL_CCABFRTX(base) (BME_UBFX32(&ZLL_PHY_CTRL_REG(base), ZLL_PHY_CTRL_CCABFRTX_SHIFT, ZLL_PHY_CTRL_CCABFRTX_WIDTH))

/*! @brief Set the CCABFRTX field to a new value. */
#define ZLL_WR_PHY_CTRL_CCABFRTX(base, value) (ZLL_RMW_PHY_CTRL(base, ZLL_PHY_CTRL_CCABFRTX_MASK, ZLL_PHY_CTRL_CCABFRTX(value)))
#define ZLL_BWR_PHY_CTRL_CCABFRTX(base, value) (BME_BFI32(&ZLL_PHY_CTRL_REG(base), ((uint32_t)(value) << ZLL_PHY_CTRL_CCABFRTX_SHIFT), ZLL_PHY_CTRL_CCABFRTX_SHIFT, ZLL_PHY_CTRL_CCABFRTX_WIDTH))
/*@}*/

/*!
 * @name Register ZLL_PHY_CTRL, field SLOTTED[6] (RW)
 *
 * Slotted Mode, for beacon-enabled networks. Applies only to Sequences T, TR,
 * and R, ignored during all other sequences. Used, in concert with CCABFRTX, to
 * determine how many CCA measurements are required prior to a transmit operation.
 * Also used during R sequence to determine whether the ensuing transmit
 * acknowledge frame (if any) needs to be synchronized to a backoff slot boundary.
 */
/*@{*/
/*! @brief Read current value of the ZLL_PHY_CTRL_SLOTTED field. */
#define ZLL_RD_PHY_CTRL_SLOTTED(base) ((ZLL_PHY_CTRL_REG(base) & ZLL_PHY_CTRL_SLOTTED_MASK) >> ZLL_PHY_CTRL_SLOTTED_SHIFT)
#define ZLL_BRD_PHY_CTRL_SLOTTED(base) (BME_UBFX32(&ZLL_PHY_CTRL_REG(base), ZLL_PHY_CTRL_SLOTTED_SHIFT, ZLL_PHY_CTRL_SLOTTED_WIDTH))

/*! @brief Set the SLOTTED field to a new value. */
#define ZLL_WR_PHY_CTRL_SLOTTED(base, value) (ZLL_RMW_PHY_CTRL(base, ZLL_PHY_CTRL_SLOTTED_MASK, ZLL_PHY_CTRL_SLOTTED(value)))
#define ZLL_BWR_PHY_CTRL_SLOTTED(base, value) (BME_BFI32(&ZLL_PHY_CTRL_REG(base), ((uint32_t)(value) << ZLL_PHY_CTRL_SLOTTED_SHIFT), ZLL_PHY_CTRL_SLOTTED_SHIFT, ZLL_PHY_CTRL_SLOTTED_WIDTH))
/*@}*/

/*!
 * @name Register ZLL_PHY_CTRL, field TMRTRIGEN[7] (RW)
 *
 * Values:
 * - 0b0 - programmed sequence initiates immediately upon write to XCVSEQ.
 * - 0b1 - allow timer TC2 (or TC2') to initiate a preprogrammed sequence (see
 *     XCVSEQ register).
 */
/*@{*/
/*! @brief Read current value of the ZLL_PHY_CTRL_TMRTRIGEN field. */
#define ZLL_RD_PHY_CTRL_TMRTRIGEN(base) ((ZLL_PHY_CTRL_REG(base) & ZLL_PHY_CTRL_TMRTRIGEN_MASK) >> ZLL_PHY_CTRL_TMRTRIGEN_SHIFT)
#define ZLL_BRD_PHY_CTRL_TMRTRIGEN(base) (BME_UBFX32(&ZLL_PHY_CTRL_REG(base), ZLL_PHY_CTRL_TMRTRIGEN_SHIFT, ZLL_PHY_CTRL_TMRTRIGEN_WIDTH))

/*! @brief Set the TMRTRIGEN field to a new value. */
#define ZLL_WR_PHY_CTRL_TMRTRIGEN(base, value) (ZLL_RMW_PHY_CTRL(base, ZLL_PHY_CTRL_TMRTRIGEN_MASK, ZLL_PHY_CTRL_TMRTRIGEN(value)))
#define ZLL_BWR_PHY_CTRL_TMRTRIGEN(base, value) (BME_BFI32(&ZLL_PHY_CTRL_REG(base), ((uint32_t)(value) << ZLL_PHY_CTRL_TMRTRIGEN_SHIFT), ZLL_PHY_CTRL_TMRTRIGEN_SHIFT, ZLL_PHY_CTRL_TMRTRIGEN_WIDTH))
/*@}*/

/*!
 * @name Register ZLL_PHY_CTRL, field SEQMSK[8] (RW)
 *
 * Values:
 * - 0b0 - allows completion of an autosequence to generate a zigbee interrupt
 * - 0b1 - Completion of an autosequence will set the SEQIRQ status bit, but a
 *     zigbee interrupt is not generated
 */
/*@{*/
/*! @brief Read current value of the ZLL_PHY_CTRL_SEQMSK field. */
#define ZLL_RD_PHY_CTRL_SEQMSK(base) ((ZLL_PHY_CTRL_REG(base) & ZLL_PHY_CTRL_SEQMSK_MASK) >> ZLL_PHY_CTRL_SEQMSK_SHIFT)
#define ZLL_BRD_PHY_CTRL_SEQMSK(base) (BME_UBFX32(&ZLL_PHY_CTRL_REG(base), ZLL_PHY_CTRL_SEQMSK_SHIFT, ZLL_PHY_CTRL_SEQMSK_WIDTH))

/*! @brief Set the SEQMSK field to a new value. */
#define ZLL_WR_PHY_CTRL_SEQMSK(base, value) (ZLL_RMW_PHY_CTRL(base, ZLL_PHY_CTRL_SEQMSK_MASK, ZLL_PHY_CTRL_SEQMSK(value)))
#define ZLL_BWR_PHY_CTRL_SEQMSK(base, value) (BME_BFI32(&ZLL_PHY_CTRL_REG(base), ((uint32_t)(value) << ZLL_PHY_CTRL_SEQMSK_SHIFT), ZLL_PHY_CTRL_SEQMSK_SHIFT, ZLL_PHY_CTRL_SEQMSK_WIDTH))
/*@}*/

/*!
 * @name Register ZLL_PHY_CTRL, field TXMSK[9] (RW)
 *
 * Values:
 * - 0b0 - allows completion of a TX operation to generate a zigbee interrupt
 * - 0b1 - Completion of a TX operation will set the TXIRQ status bit, but a
 *     zigbee interrupt is not generated
 */
/*@{*/
/*! @brief Read current value of the ZLL_PHY_CTRL_TXMSK field. */
#define ZLL_RD_PHY_CTRL_TXMSK(base) ((ZLL_PHY_CTRL_REG(base) & ZLL_PHY_CTRL_TXMSK_MASK) >> ZLL_PHY_CTRL_TXMSK_SHIFT)
#define ZLL_BRD_PHY_CTRL_TXMSK(base) (BME_UBFX32(&ZLL_PHY_CTRL_REG(base), ZLL_PHY_CTRL_TXMSK_SHIFT, ZLL_PHY_CTRL_TXMSK_WIDTH))

/*! @brief Set the TXMSK field to a new value. */
#define ZLL_WR_PHY_CTRL_TXMSK(base, value) (ZLL_RMW_PHY_CTRL(base, ZLL_PHY_CTRL_TXMSK_MASK, ZLL_PHY_CTRL_TXMSK(value)))
#define ZLL_BWR_PHY_CTRL_TXMSK(base, value) (BME_BFI32(&ZLL_PHY_CTRL_REG(base), ((uint32_t)(value) << ZLL_PHY_CTRL_TXMSK_SHIFT), ZLL_PHY_CTRL_TXMSK_SHIFT, ZLL_PHY_CTRL_TXMSK_WIDTH))
/*@}*/

/*!
 * @name Register ZLL_PHY_CTRL, field RXMSK[10] (RW)
 *
 * Values:
 * - 0b0 - allows completion of a RX operation to generate a zigbee interrupt
 * - 0b1 - Completion of a RX operation will set the RXIRQ status bit, but a
 *     zigbee interrupt is not generated
 */
/*@{*/
/*! @brief Read current value of the ZLL_PHY_CTRL_RXMSK field. */
#define ZLL_RD_PHY_CTRL_RXMSK(base) ((ZLL_PHY_CTRL_REG(base) & ZLL_PHY_CTRL_RXMSK_MASK) >> ZLL_PHY_CTRL_RXMSK_SHIFT)
#define ZLL_BRD_PHY_CTRL_RXMSK(base) (BME_UBFX32(&ZLL_PHY_CTRL_REG(base), ZLL_PHY_CTRL_RXMSK_SHIFT, ZLL_PHY_CTRL_RXMSK_WIDTH))

/*! @brief Set the RXMSK field to a new value. */
#define ZLL_WR_PHY_CTRL_RXMSK(base, value) (ZLL_RMW_PHY_CTRL(base, ZLL_PHY_CTRL_RXMSK_MASK, ZLL_PHY_CTRL_RXMSK(value)))
#define ZLL_BWR_PHY_CTRL_RXMSK(base, value) (BME_BFI32(&ZLL_PHY_CTRL_REG(base), ((uint32_t)(value) << ZLL_PHY_CTRL_RXMSK_SHIFT), ZLL_PHY_CTRL_RXMSK_SHIFT, ZLL_PHY_CTRL_RXMSK_WIDTH))
/*@}*/

/*!
 * @name Register ZLL_PHY_CTRL, field CCAMSK[11] (RW)
 *
 * CCA Interrupt Mask
 *
 * Values:
 * - 0b0 - allows completion of a CCA operation to generate a zigbee interrupt
 * - 0b1 - Completion of a CCA operation will set the CCAIRQ status bit, but an
 *     zigbee interrupt
 */
/*@{*/
/*! @brief Read current value of the ZLL_PHY_CTRL_CCAMSK field. */
#define ZLL_RD_PHY_CTRL_CCAMSK(base) ((ZLL_PHY_CTRL_REG(base) & ZLL_PHY_CTRL_CCAMSK_MASK) >> ZLL_PHY_CTRL_CCAMSK_SHIFT)
#define ZLL_BRD_PHY_CTRL_CCAMSK(base) (BME_UBFX32(&ZLL_PHY_CTRL_REG(base), ZLL_PHY_CTRL_CCAMSK_SHIFT, ZLL_PHY_CTRL_CCAMSK_WIDTH))

