RT-Thread/rt-thread/bsp/freescale/platform/devices/MKW30Z4/include/MKW30Z4_extension.h
/*! @brief Set the CCAMSK field to a new value. */
#define ZLL_WR_PHY_CTRL_CCAMSK(base, value) (ZLL_RMW_PHY_CTRL(base, ZLL_PHY_CTRL_CCAMSK_MASK, ZLL_PHY_CTRL_CCAMSK(value)))
#define ZLL_BWR_PHY_CTRL_CCAMSK(base, value) (BME_BFI32(&ZLL_PHY_CTRL_REG(base), ((uint32_t)(value) << ZLL_PHY_CTRL_CCAMSK_SHIFT), ZLL_PHY_CTRL_CCAMSK_SHIFT, ZLL_PHY_CTRL_CCAMSK_WIDTH))
/*@}*/

/*!
 * @name Register ZLL_PHY_CTRL, field RX_WMRK_MSK[12] (RW)
 *
 * RX Watermark Interrupt Mask
 *
 * Values:
 * - 0b0 - allows a Received Byte Count match to the RX_WTR_MARK threshold
 *     register to generate a zigbee interrupt
 * - 0b1 - A Received Byte Count match to the RX_WTR_MARK threshold register
 *     will set the RXWTRMRKIRQ status bit, but a zigbee interrupt is not generated
 */
/*@{*/
/*! @brief Read current value of the ZLL_PHY_CTRL_RX_WMRK_MSK field. */
#define ZLL_RD_PHY_CTRL_RX_WMRK_MSK(base) ((ZLL_PHY_CTRL_REG(base) & ZLL_PHY_CTRL_RX_WMRK_MSK_MASK) >> ZLL_PHY_CTRL_RX_WMRK_MSK_SHIFT)
#define ZLL_BRD_PHY_CTRL_RX_WMRK_MSK(base) (BME_UBFX32(&ZLL_PHY_CTRL_REG(base), ZLL_PHY_CTRL_RX_WMRK_MSK_SHIFT, ZLL_PHY_CTRL_RX_WMRK_MSK_WIDTH))

/*! @brief Set the RX_WMRK_MSK field to a new value. */
#define ZLL_WR_PHY_CTRL_RX_WMRK_MSK(base, value) (ZLL_RMW_PHY_CTRL(base, ZLL_PHY_CTRL_RX_WMRK_MSK_MASK, ZLL_PHY_CTRL_RX_WMRK_MSK(value)))
#define ZLL_BWR_PHY_CTRL_RX_WMRK_MSK(base, value) (BME_BFI32(&ZLL_PHY_CTRL_REG(base), ((uint32_t)(value) << ZLL_PHY_CTRL_RX_WMRK_MSK_SHIFT), ZLL_PHY_CTRL_RX_WMRK_MSK_SHIFT, ZLL_PHY_CTRL_RX_WMRK_MSK_WIDTH))
/*@}*/

/*!
 * @name Register ZLL_PHY_CTRL, field FILTERFAIL_MSK[13] (RW)
 *
 * FilterFail Interrupt Mask
 *
 * Values:
 * - 0b0 - allows Packet Processor Filtering Failure to generate a zigbee
 *     interrupt
 * - 0b1 - A Packet Processor Filtering Failure will set the FILTERFAIL_IRQ
 *     status bit, but a zigbee interrupt is not generated
 */
/*@{*/
/*! @brief Read current value of the ZLL_PHY_CTRL_FILTERFAIL_MSK field. */
#define ZLL_RD_PHY_CTRL_FILTERFAIL_MSK(base) ((ZLL_PHY_CTRL_REG(base) & ZLL_PHY_CTRL_FILTERFAIL_MSK_MASK) >> ZLL_PHY_CTRL_FILTERFAIL_MSK_SHIFT)
#define ZLL_BRD_PHY_CTRL_FILTERFAIL_MSK(base) (BME_UBFX32(&ZLL_PHY_CTRL_REG(base), ZLL_PHY_CTRL_FILTERFAIL_MSK_SHIFT, ZLL_PHY_CTRL_FILTERFAIL_MSK_WIDTH))

/*! @brief Set the FILTERFAIL_MSK field to a new value. */
#define ZLL_WR_PHY_CTRL_FILTERFAIL_MSK(base, value) (ZLL_RMW_PHY_CTRL(base, ZLL_PHY_CTRL_FILTERFAIL_MSK_MASK, ZLL_PHY_CTRL_FILTERFAIL_MSK(value)))
#define ZLL_BWR_PHY_CTRL_FILTERFAIL_MSK(base, value) (BME_BFI32(&ZLL_PHY_CTRL_REG(base), ((uint32_t)(value) << ZLL_PHY_CTRL_FILTERFAIL_MSK_SHIFT), ZLL_PHY_CTRL_FILTERFAIL_MSK_SHIFT, ZLL_PHY_CTRL_FILTERFAIL_MSK_WIDTH))
/*@}*/

/*!
 * @name Register ZLL_PHY_CTRL, field PLL_UNLOCK_MSK[14] (RW)
 *
 * Values:
 * - 0b0 - allows PLL unlock event to generate a zigbee interrupt
 * - 0b1 - A PLL unlock event will set the PLL_UNLOCK_IRQ status bit, but a
 *     zigbee interrupt is not generated
 */
/*@{*/
/*! @brief Read current value of the ZLL_PHY_CTRL_PLL_UNLOCK_MSK field. */
#define ZLL_RD_PHY_CTRL_PLL_UNLOCK_MSK(base) ((ZLL_PHY_CTRL_REG(base) & ZLL_PHY_CTRL_PLL_UNLOCK_MSK_MASK) >> ZLL_PHY_CTRL_PLL_UNLOCK_MSK_SHIFT)
#define ZLL_BRD_PHY_CTRL_PLL_UNLOCK_MSK(base) (BME_UBFX32(&ZLL_PHY_CTRL_REG(base), ZLL_PHY_CTRL_PLL_UNLOCK_MSK_SHIFT, ZLL_PHY_CTRL_PLL_UNLOCK_MSK_WIDTH))

/*! @brief Set the PLL_UNLOCK_MSK field to a new value. */
#define ZLL_WR_PHY_CTRL_PLL_UNLOCK_MSK(base, value) (ZLL_RMW_PHY_CTRL(base, ZLL_PHY_CTRL_PLL_UNLOCK_MSK_MASK, ZLL_PHY_CTRL_PLL_UNLOCK_MSK(value)))
#define ZLL_BWR_PHY_CTRL_PLL_UNLOCK_MSK(base, value) (BME_BFI32(&ZLL_PHY_CTRL_REG(base), ((uint32_t)(value) << ZLL_PHY_CTRL_PLL_UNLOCK_MSK_SHIFT), ZLL_PHY_CTRL_PLL_UNLOCK_MSK_SHIFT, ZLL_PHY_CTRL_PLL_UNLOCK_MSK_WIDTH))
/*@}*/

/*!
 * @name Register ZLL_PHY_CTRL, field CRC_MSK[15] (RW)
 *
 * CRC Mask
 *
 * Values:
 * - 0b0 - sequence manager ignores CRCVALID and considers the receive operation
 *     complete after the last octet of the frame has been received.
 * - 0b1 - sequence manager requires CRCVALID=1 at the end of the received frame
 *     in order for the receive operation to complete successfully; if
 *     CRCVALID=0, sequence manager will return to preamble-detect mode after the last
 *     octet of the frame has been received.
 */
/*@{*/
/*! @brief Read current value of the ZLL_PHY_CTRL_CRC_MSK field. */
#define ZLL_RD_PHY_CTRL_CRC_MSK(base) ((ZLL_PHY_CTRL_REG(base) & ZLL_PHY_CTRL_CRC_MSK_MASK) >> ZLL_PHY_CTRL_CRC_MSK_SHIFT)
#define ZLL_BRD_PHY_CTRL_CRC_MSK(base) (BME_UBFX32(&ZLL_PHY_CTRL_REG(base), ZLL_PHY_CTRL_CRC_MSK_SHIFT, ZLL_PHY_CTRL_CRC_MSK_WIDTH))

/*! @brief Set the CRC_MSK field to a new value. */
#define ZLL_WR_PHY_CTRL_CRC_MSK(base, value) (ZLL_RMW_PHY_CTRL(base, ZLL_PHY_CTRL_CRC_MSK_MASK, ZLL_PHY_CTRL_CRC_MSK(value)))
#define ZLL_BWR_PHY_CTRL_CRC_MSK(base, value) (BME_BFI32(&ZLL_PHY_CTRL_REG(base), ((uint32_t)(value) << ZLL_PHY_CTRL_CRC_MSK_SHIFT), ZLL_PHY_CTRL_CRC_MSK_SHIFT, ZLL_PHY_CTRL_CRC_MSK_WIDTH))
/*@}*/

/*!
 * @name Register ZLL_PHY_CTRL, field PB_ERR_MSK[17] (RW)
 *
 * Values:
 * - 0b0 - Enable Packet Buffer Error to assert a zigbee interrupt
 * - 0b1 - Mask Packet Buffer Error from generating a zigbee interrupt
 */
/*@{*/
/*! @brief Read current value of the ZLL_PHY_CTRL_PB_ERR_MSK field. */
#define ZLL_RD_PHY_CTRL_PB_ERR_MSK(base) ((ZLL_PHY_CTRL_REG(base) & ZLL_PHY_CTRL_PB_ERR_MSK_MASK) >> ZLL_PHY_CTRL_PB_ERR_MSK_SHIFT)
#define ZLL_BRD_PHY_CTRL_PB_ERR_MSK(base) (BME_UBFX32(&ZLL_PHY_CTRL_REG(base), ZLL_PHY_CTRL_PB_ERR_MSK_SHIFT, ZLL_PHY_CTRL_PB_ERR_MSK_WIDTH))

/*! @brief Set the PB_ERR_MSK field to a new value. */
#define ZLL_WR_PHY_CTRL_PB_ERR_MSK(base, value) (ZLL_RMW_PHY_CTRL(base, ZLL_PHY_CTRL_PB_ERR_MSK_MASK, ZLL_PHY_CTRL_PB_ERR_MSK(value)))
#define ZLL_BWR_PHY_CTRL_PB_ERR_MSK(base, value) (BME_BFI32(&ZLL_PHY_CTRL_REG(base), ((uint32_t)(value) << ZLL_PHY_CTRL_PB_ERR_MSK_SHIFT), ZLL_PHY_CTRL_PB_ERR_MSK_SHIFT, ZLL_PHY_CTRL_PB_ERR_MSK_WIDTH))
/*@}*/

/*!
 * @name Register ZLL_PHY_CTRL, field TMR1CMP_EN[20] (RW)
 *
 * Values:
 * - 0b0 - Don't allow an Event Timer Match to T1CMP to set TMR1IRQ
 * - 0b1 - Allow an Event Timer Match to T1CMP to set TMR1IRQ
 */
/*@{*/
/*! @brief Read current value of the ZLL_PHY_CTRL_TMR1CMP_EN field. */
#define ZLL_RD_PHY_CTRL_TMR1CMP_EN(base) ((ZLL_PHY_CTRL_REG(base) & ZLL_PHY_CTRL_TMR1CMP_EN_MASK) >> ZLL_PHY_CTRL_TMR1CMP_EN_SHIFT)
#define ZLL_BRD_PHY_CTRL_TMR1CMP_EN(base) (BME_UBFX32(&ZLL_PHY_CTRL_REG(base), ZLL_PHY_CTRL_TMR1CMP_EN_SHIFT, ZLL_PHY_CTRL_TMR1CMP_EN_WIDTH))

