RT-Thread/rt-thread/bsp/freescale/platform/devices/MKW30Z4/include/MKW30Z4_extension.h
/*
 * Constants & macros for individual ZLL_T2PRIMECMP bitfields
 */

/*!
 * @name Register ZLL_T2PRIMECMP, field T2PRIMECMP[15:0] (RW)
 */
/*@{*/
/*! @brief Read current value of the ZLL_T2PRIMECMP_T2PRIMECMP field. */
#define ZLL_RD_T2PRIMECMP_T2PRIMECMP(base) ((ZLL_T2PRIMECMP_REG(base) & ZLL_T2PRIMECMP_T2PRIMECMP_MASK) >> ZLL_T2PRIMECMP_T2PRIMECMP_SHIFT)
#define ZLL_BRD_T2PRIMECMP_T2PRIMECMP(base) (BME_UBFX32(&ZLL_T2PRIMECMP_REG(base), ZLL_T2PRIMECMP_T2PRIMECMP_SHIFT, ZLL_T2PRIMECMP_T2PRIMECMP_WIDTH))

/*! @brief Set the T2PRIMECMP field to a new value. */
#define ZLL_WR_T2PRIMECMP_T2PRIMECMP(base, value) (ZLL_RMW_T2PRIMECMP(base, ZLL_T2PRIMECMP_T2PRIMECMP_MASK, ZLL_T2PRIMECMP_T2PRIMECMP(value)))
#define ZLL_BWR_T2PRIMECMP_T2PRIMECMP(base, value) (BME_BFI32(&ZLL_T2PRIMECMP_REG(base), ((uint32_t)(value) << ZLL_T2PRIMECMP_T2PRIMECMP_SHIFT), ZLL_T2PRIMECMP_T2PRIMECMP_SHIFT, ZLL_T2PRIMECMP_T2PRIMECMP_WIDTH))
/*@}*/

/*******************************************************************************
 * ZLL_T3CMP - T3 COMPARE
 ******************************************************************************/

/*!
 * @brief ZLL_T3CMP - T3 COMPARE (RW)
 *
 * Reset value: 0x00FFFFFFU
 *
 * TMR3 compare value. If TMR3CMP_EN=1 and the Event Timer matches this value,
 * TMR3IRQ is set.
 */
/*!
 * @name Constants and macros for entire ZLL_T3CMP register
 */
/*@{*/
#define ZLL_RD_T3CMP(base)       (ZLL_T3CMP_REG(base))
#define ZLL_WR_T3CMP(base, value) (ZLL_T3CMP_REG(base) = (value))
#define ZLL_RMW_T3CMP(base, mask, value) (ZLL_WR_T3CMP(base, (ZLL_RD_T3CMP(base) & ~(mask)) | (value)))
#define ZLL_SET_T3CMP(base, value) (BME_OR32(&ZLL_T3CMP_REG(base), (uint32_t)(value)))
#define ZLL_CLR_T3CMP(base, value) (BME_AND32(&ZLL_T3CMP_REG(base), (uint32_t)(~(value))))
#define ZLL_TOG_T3CMP(base, value) (BME_XOR32(&ZLL_T3CMP_REG(base), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual ZLL_T3CMP bitfields
 */

/*!
 * @name Register ZLL_T3CMP, field T3CMP[23:0] (RW)
 */
/*@{*/
/*! @brief Read current value of the ZLL_T3CMP_T3CMP field. */
#define ZLL_RD_T3CMP_T3CMP(base) ((ZLL_T3CMP_REG(base) & ZLL_T3CMP_T3CMP_MASK) >> ZLL_T3CMP_T3CMP_SHIFT)
#define ZLL_BRD_T3CMP_T3CMP(base) (ZLL_RD_T3CMP_T3CMP(base))

/*! @brief Set the T3CMP field to a new value. */
#define ZLL_WR_T3CMP_T3CMP(base, value) (ZLL_RMW_T3CMP(base, ZLL_T3CMP_T3CMP_MASK, ZLL_T3CMP_T3CMP(value)))
#define ZLL_BWR_T3CMP_T3CMP(base, value) (ZLL_WR_T3CMP_T3CMP(base, value))
/*@}*/

/*******************************************************************************
 * ZLL_T4CMP - T4 COMPARE
 ******************************************************************************/

/*!
 * @brief ZLL_T4CMP - T4 COMPARE (RW)
 *
 * Reset value: 0x00FFFFFFU
 *
 * TMR4 compare value. If TMR4CMP_EN=1 and the Event Timer matches this value,
 * TMR4IRQ is set.
 */
/*!
 * @name Constants and macros for entire ZLL_T4CMP register
 */
/*@{*/
#define ZLL_RD_T4CMP(base)       (ZLL_T4CMP_REG(base))
#define ZLL_WR_T4CMP(base, value) (ZLL_T4CMP_REG(base) = (value))
#define ZLL_RMW_T4CMP(base, mask, value) (ZLL_WR_T4CMP(base, (ZLL_RD_T4CMP(base) & ~(mask)) | (value)))
#define ZLL_SET_T4CMP(base, value) (BME_OR32(&ZLL_T4CMP_REG(base), (uint32_t)(value)))
#define ZLL_CLR_T4CMP(base, value) (BME_AND32(&ZLL_T4CMP_REG(base), (uint32_t)(~(value))))
#define ZLL_TOG_T4CMP(base, value) (BME_XOR32(&ZLL_T4CMP_REG(base), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual ZLL_T4CMP bitfields
 */

/*!
 * @name Register ZLL_T4CMP, field T4CMP[23:0] (RW)
 */
/*@{*/
/*! @brief Read current value of the ZLL_T4CMP_T4CMP field. */
#define ZLL_RD_T4CMP_T4CMP(base) ((ZLL_T4CMP_REG(base) & ZLL_T4CMP_T4CMP_MASK) >> ZLL_T4CMP_T4CMP_SHIFT)
#define ZLL_BRD_T4CMP_T4CMP(base) (ZLL_RD_T4CMP_T4CMP(base))

/*! @brief Set the T4CMP field to a new value. */
#define ZLL_WR_T4CMP_T4CMP(base, value) (ZLL_RMW_T4CMP(base, ZLL_T4CMP_T4CMP_MASK, ZLL_T4CMP_T4CMP(value)))
#define ZLL_BWR_T4CMP_T4CMP(base, value) (ZLL_WR_T4CMP_T4CMP(base, value))
/*@}*/

/*******************************************************************************
 * ZLL_PA_PWR - PA POWER
 ******************************************************************************/

/*!
 * @brief ZLL_PA_PWR - PA POWER (RW)
 *
 * Reset value: 0x00000008U
 *
 * PA Target Power used to transmit Zigbee packets
 */
/*!
 * @name Constants and macros for entire ZLL_PA_PWR register
 */
/*@{*/
#define ZLL_RD_PA_PWR(base)      (ZLL_PA_PWR_REG(base))
#define ZLL_WR_PA_PWR(base, value) (ZLL_PA_PWR_REG(base) = (value))
#define ZLL_RMW_PA_PWR(base, mask, value) (ZLL_WR_PA_PWR(base, (ZLL_RD_PA_PWR(base) & ~(mask)) | (value)))
#define ZLL_SET_PA_PWR(base, value) (BME_OR32(&ZLL_PA_PWR_REG(base), (uint32_t)(value)))
#define ZLL_CLR_PA_PWR(base, value) (BME_AND32(&ZLL_PA_PWR_REG(base), (uint32_t)(~(value))))
#define ZLL_TOG_PA_PWR(base, value) (BME_XOR32(&ZLL_PA_PWR_REG(base), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual ZLL_PA_PWR bitfields
 */

/*!
 * @name Register ZLL_PA_PWR, field PA_PWR[3:0] (RW)
 */
/*@{*/
/*! @brief Read current value of the ZLL_PA_PWR_PA_PWR field. */
#define ZLL_RD_PA_PWR_PA_PWR(base) ((ZLL_PA_PWR_REG(base) & ZLL_PA_PWR_PA_PWR_MASK) >> ZLL_PA_PWR_PA_PWR_SHIFT)
#define ZLL_BRD_PA_PWR_PA_PWR(base) (BME_UBFX32(&ZLL_PA_PWR_REG(base), ZLL_PA_PWR_PA_PWR_SHIFT, ZLL_PA_PWR_PA_PWR_WIDTH))

/*! @brief Set the PA_PWR field to a new value. */
#define ZLL_WR_PA_PWR_PA_PWR(base, value) (ZLL_RMW_PA_PWR(base, ZLL_PA_PWR_PA_PWR_MASK, ZLL_PA_PWR_PA_PWR(value)))
#define ZLL_BWR_PA_PWR_PA_PWR(base, value) (BME_BFI32(&ZLL_PA_PWR_REG(base), ((uint32_t)(value) << ZLL_PA_PWR_PA_PWR_SHIFT), ZLL_PA_PWR_PA_PWR_SHIFT, ZLL_PA_PWR_PA_PWR_WIDTH))
/*@}*/

/*******************************************************************************
 * ZLL_CHANNEL_NUM0 - CHANNEL NUMBER 0
 ******************************************************************************/

/*!
 * @brief ZLL_CHANNEL_NUM0 - CHANNEL NUMBER 0 (RW)
 *
 * Reset value: 0x00000012U
 *
 * This is the mapped channel number used to transmit and receive Zigbee
 * packets. If Dual PAN is engaged, this register applies to PAN0. CHANNEL_NUM0 should
 * be in the range: 11 <= CHANNEL_NUM0 <= 26
 */
/*!
 * @name Constants and macros for entire ZLL_CHANNEL_NUM0 register
 */
/*@{*/
#define ZLL_RD_CHANNEL_NUM0(base) (ZLL_CHANNEL_NUM0_REG(base))
#define ZLL_WR_CHANNEL_NUM0(base, value) (ZLL_CHANNEL_NUM0_REG(base) = (value))
#define ZLL_RMW_CHANNEL_NUM0(base, mask, value) (ZLL_WR_CHANNEL_NUM0(base, (ZLL_RD_CHANNEL_NUM0(base) & ~(mask)) | (value)))
#define ZLL_SET_CHANNEL_NUM0(base, value) (BME_OR32(&ZLL_CHANNEL_NUM0_REG(base), (uint32_t)(value)))
#define ZLL_CLR_CHANNEL_NUM0(base, value) (BME_AND32(&ZLL_CHANNEL_NUM0_REG(base), (uint32_t)(~(value))))
#define ZLL_TOG_CHANNEL_NUM0(base, value) (BME_XOR32(&ZLL_CHANNEL_NUM0_REG(base), (uint32_t)(value)))
/*@}*/

