RT-Thread/rt-thread/bsp/freescale/platform/devices/MKW30Z4/include/MKW30Z4_extension.h
/*******************************************************************************
 * ZLL_RX_WTR_MARK - RECEIVE WATER MARK
 ******************************************************************************/

/*!
 * @brief ZLL_RX_WTR_MARK - RECEIVE WATER MARK (RW)
 *
 * Reset value: 0x000000FFU
 *
 * Receive byte count (octets) needed to trigger a RXWTRMRKIRQ interrupt . A
 * setting of 0 generates an interrupt at end of the Frame Length field (first byte
 * after SFD). A setting of 1 generates an interrupt after the first byte of
 * Frame Control Field, etc.
 */
/*!
 * @name Constants and macros for entire ZLL_RX_WTR_MARK register
 */
/*@{*/
#define ZLL_RD_RX_WTR_MARK(base) (ZLL_RX_WTR_MARK_REG(base))
#define ZLL_WR_RX_WTR_MARK(base, value) (ZLL_RX_WTR_MARK_REG(base) = (value))
#define ZLL_RMW_RX_WTR_MARK(base, mask, value) (ZLL_WR_RX_WTR_MARK(base, (ZLL_RD_RX_WTR_MARK(base) & ~(mask)) | (value)))
#define ZLL_SET_RX_WTR_MARK(base, value) (BME_OR32(&ZLL_RX_WTR_MARK_REG(base), (uint32_t)(value)))
#define ZLL_CLR_RX_WTR_MARK(base, value) (BME_AND32(&ZLL_RX_WTR_MARK_REG(base), (uint32_t)(~(value))))
#define ZLL_TOG_RX_WTR_MARK(base, value) (BME_XOR32(&ZLL_RX_WTR_MARK_REG(base), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual ZLL_RX_WTR_MARK bitfields
 */

/*!
 * @name Register ZLL_RX_WTR_MARK, field RX_WTR_MARK[7:0] (RW)
 */
/*@{*/
/*! @brief Read current value of the ZLL_RX_WTR_MARK_RX_WTR_MARK field. */
#define ZLL_RD_RX_WTR_MARK_RX_WTR_MARK(base) ((ZLL_RX_WTR_MARK_REG(base) & ZLL_RX_WTR_MARK_RX_WTR_MARK_MASK) >> ZLL_RX_WTR_MARK_RX_WTR_MARK_SHIFT)
#define ZLL_BRD_RX_WTR_MARK_RX_WTR_MARK(base) (BME_UBFX32(&ZLL_RX_WTR_MARK_REG(base), ZLL_RX_WTR_MARK_RX_WTR_MARK_SHIFT, ZLL_RX_WTR_MARK_RX_WTR_MARK_WIDTH))

/*! @brief Set the RX_WTR_MARK field to a new value. */
#define ZLL_WR_RX_WTR_MARK_RX_WTR_MARK(base, value) (ZLL_RMW_RX_WTR_MARK(base, ZLL_RX_WTR_MARK_RX_WTR_MARK_MASK, ZLL_RX_WTR_MARK_RX_WTR_MARK(value)))
#define ZLL_BWR_RX_WTR_MARK_RX_WTR_MARK(base, value) (BME_BFI32(&ZLL_RX_WTR_MARK_REG(base), ((uint32_t)(value) << ZLL_RX_WTR_MARK_RX_WTR_MARK_SHIFT), ZLL_RX_WTR_MARK_RX_WTR_MARK_SHIFT, ZLL_RX_WTR_MARK_RX_WTR_MARK_WIDTH))
/*@}*/

/*******************************************************************************
 * ZLL_SLOT_PRELOAD - SLOT PRELOAD
 ******************************************************************************/

/*!
 * @brief ZLL_SLOT_PRELOAD - SLOT PRELOAD (RW)
 *
 * Reset value: 0x00000074U
 *
 * This register represents the number that gets loaded into the slot_timer at
 * SFD detect, which ultimately determines when the next slot boundary will occur.
 * Due to processing delays within the analog front-end and digital modem, the
 * point at which SFD is detected by the modem, is delayed relative to
 * over-the-air timing. Since this timing may not be known for coconino until actual
 * silicon, and since this is such a critical timing parameter for slotted operations,
 * it has been made programmable. This timing parameter is critical for the
 * Sequence R autosequence in slotted mode, when an automatic TxAck is required.
 */
/*!
 * @name Constants and macros for entire ZLL_SLOT_PRELOAD register
 */
/*@{*/
#define ZLL_RD_SLOT_PRELOAD(base) (ZLL_SLOT_PRELOAD_REG(base))
#define ZLL_WR_SLOT_PRELOAD(base, value) (ZLL_SLOT_PRELOAD_REG(base) = (value))
#define ZLL_RMW_SLOT_PRELOAD(base, mask, value) (ZLL_WR_SLOT_PRELOAD(base, (ZLL_RD_SLOT_PRELOAD(base) & ~(mask)) | (value)))
#define ZLL_SET_SLOT_PRELOAD(base, value) (BME_OR32(&ZLL_SLOT_PRELOAD_REG(base), (uint32_t)(value)))
#define ZLL_CLR_SLOT_PRELOAD(base, value) (BME_AND32(&ZLL_SLOT_PRELOAD_REG(base), (uint32_t)(~(value))))
#define ZLL_TOG_SLOT_PRELOAD(base, value) (BME_XOR32(&ZLL_SLOT_PRELOAD_REG(base), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual ZLL_SLOT_PRELOAD bitfields
 */

/*!
 * @name Register ZLL_SLOT_PRELOAD, field SLOT_PRELOAD[7:0] (RW)
 */
/*@{*/
/*! @brief Read current value of the ZLL_SLOT_PRELOAD_SLOT_PRELOAD field. */
#define ZLL_RD_SLOT_PRELOAD_SLOT_PRELOAD(base) ((ZLL_SLOT_PRELOAD_REG(base) & ZLL_SLOT_PRELOAD_SLOT_PRELOAD_MASK) >> ZLL_SLOT_PRELOAD_SLOT_PRELOAD_SHIFT)
#define ZLL_BRD_SLOT_PRELOAD_SLOT_PRELOAD(base) (BME_UBFX32(&ZLL_SLOT_PRELOAD_REG(base), ZLL_SLOT_PRELOAD_SLOT_PRELOAD_SHIFT, ZLL_SLOT_PRELOAD_SLOT_PRELOAD_WIDTH))

/*! @brief Set the SLOT_PRELOAD field to a new value. */
#define ZLL_WR_SLOT_PRELOAD_SLOT_PRELOAD(base, value) (ZLL_RMW_SLOT_PRELOAD(base, ZLL_SLOT_PRELOAD_SLOT_PRELOAD_MASK, ZLL_SLOT_PRELOAD_SLOT_PRELOAD(value)))
#define ZLL_BWR_SLOT_PRELOAD_SLOT_PRELOAD(base, value) (BME_BFI32(&ZLL_SLOT_PRELOAD_REG(base), ((uint32_t)(value) << ZLL_SLOT_PRELOAD_SLOT_PRELOAD_SHIFT), ZLL_SLOT_PRELOAD_SLOT_PRELOAD_SHIFT, ZLL_SLOT_PRELOAD_SLOT_PRELOAD_WIDTH))
/*@}*/

/*******************************************************************************
 * ZLL_SEQ_STATE - ZIGBEE SEQUENCE STATE
 ******************************************************************************/

/*!
 * @brief ZLL_SEQ_STATE - ZIGBEE SEQUENCE STATE (RO)
 *
 * Reset value: 0x00000000U
 *
 * Zigbee Sequence State Register
 */
/*!
 * @name Constants and macros for entire ZLL_SEQ_STATE register
 */
/*@{*/
#define ZLL_RD_SEQ_STATE(base)   (ZLL_SEQ_STATE_REG(base))
/*@}*/

/*
 * Constants & macros for individual ZLL_SEQ_STATE bitfields
 */

/*!
 * @name Register ZLL_SEQ_STATE, field SEQ_STATE[4:0] (RO)
 *
 * This read-only register reflects the instantaneous state of the Zigbee
 * Sequence Manager
 */
/*@{*/
/*! @brief Read current value of the ZLL_SEQ_STATE_SEQ_STATE field. */
#define ZLL_RD_SEQ_STATE_SEQ_STATE(base) ((ZLL_SEQ_STATE_REG(base) & ZLL_SEQ_STATE_SEQ_STATE_MASK) >> ZLL_SEQ_STATE_SEQ_STATE_SHIFT)
#define ZLL_BRD_SEQ_STATE_SEQ_STATE(base) (BME_UBFX32(&ZLL_SEQ_STATE_REG(base), ZLL_SEQ_STATE_SEQ_STATE_SHIFT, ZLL_SEQ_STATE_SEQ_STATE_WIDTH))
/*@}*/

/*!
 * @name Register ZLL_SEQ_STATE, field PREAMBLE_DET[8] (RO)
 *
 * 0: an 802.15.4 preamble has not been detected. 1: An 802.15.4 preamble has
 * been detected. The function of this read-only bit depends on the setting of the
 * LATCH_PREAMBLE bit of the SEQ_MGR_CTRL register. If LATCH_PREAMBLE=1, any
 * preamble detection during a Sequence R (even false detections), will set this bit,
 * and it will remain set (sticky) until the start of the next autosequence. If
 * LATCH_PREAMBLE=0, this bit is not sticky, and reflects the instantaneous state
 * of the preamble-detection circuit; for false preambles, the bit will clear
 * when the false nature of the preamble is recognized. When LATCH_PREAMBLE=0,
 * PREAMBLE_DET should be considered valid only while an autosequence is underway.
 */
/*@{*/
/*! @brief Read current value of the ZLL_SEQ_STATE_PREAMBLE_DET field. */
#define ZLL_RD_SEQ_STATE_PREAMBLE_DET(base) ((ZLL_SEQ_STATE_REG(base) & ZLL_SEQ_STATE_PREAMBLE_DET_MASK) >> ZLL_SEQ_STATE_PREAMBLE_DET_SHIFT)
#define ZLL_BRD_SEQ_STATE_PREAMBLE_DET(base) (BME_UBFX32(&ZLL_SEQ_STATE_REG(base), ZLL_SEQ_STATE_PREAMBLE_DET_SHIFT, ZLL_SEQ_STATE_PREAMBLE_DET_WIDTH))
/*@}*/

/*!
 * @name Register ZLL_SEQ_STATE, field SFD_DET[9] (RO)
 *
 * 0: an 802.15.4 preamble-and-SFD have not been detected. 1: An 802.15.4
 * preamble-and-SFD have been detected. The function of this read-only bit depends on
 * the setting of the LATCH_PREAMBLE bit of the SEQ_MGR_CTRL register. If
 * LATCH_PREAMBLE=1, any preamble-and-SFD detection during a Sequence R (even false
 * detections), will set this bit, and it will remain set (sticky) until the start of
 * the next autosequence. If LATCH_PREAMBLE=0, this bit is not sticky, and
 * reflects the instantaneous state of the SFD-detection circuit; for false SFD, the
 * bit will clear when the false nature of the SFD is recognized (i.e., an RX
 * recycle). When LATCH_PREAMBLE=0, SFD_DET should be considered valid only while an
 * autosequence is underway.
 */
/*@{*/
/*! @brief Read current value of the ZLL_SEQ_STATE_SFD_DET field. */
#define ZLL_RD_SEQ_STATE_SFD_DET(base) ((ZLL_SEQ_STATE_REG(base) & ZLL_SEQ_STATE_SFD_DET_MASK) >> ZLL_SEQ_STATE_SFD_DET_SHIFT)
#define ZLL_BRD_SEQ_STATE_SFD_DET(base) (BME_UBFX32(&ZLL_SEQ_STATE_REG(base), ZLL_SEQ_STATE_SFD_DET_SHIFT, ZLL_SEQ_STATE_SFD_DET_WIDTH))
/*@}*/

/*!
 * @name Register ZLL_SEQ_STATE, field FILTERFAIL_FLAG_SEL[10] (RO)
 *
 * 0: The incoming, or just-received packet, passed packet filtering rules. 1:
 * The incoming, or just-received packet, failed packet filtering rules When
 * FILTERFAIL_FLAG_SEL=1, a non-zero FILTERFAIL_CODE is present (see FILTERFAIL_CODE
 * registers). In Dual PAN mode, FILTERFAIL_FLAG_SEL applies to either or both
 * networks, as follows: A: If PAN0 and PAN1 occupy different channels and
 * CURRENT_NETWORK=0, FILTERFAIL_FLAG_SEL applies to PAN0. B: If PAN0 and PAN1 occupy
 * different channels and CURRENT_NETWORK=1, FILTERFAIL_FLAG_SEL applies to PAN1. C:
 * If PAN0 and PAN1 occupy the same channel, FILTERFAIL_FLAG_SEL is the logical
 * 'AND' of the individual PANs' FILTERFAIL_FLAG bits.
 */
/*@{*/
/*! @brief Read current value of the ZLL_SEQ_STATE_FILTERFAIL_FLAG_SEL field. */
#define ZLL_RD_SEQ_STATE_FILTERFAIL_FLAG_SEL(base) ((ZLL_SEQ_STATE_REG(base) & ZLL_SEQ_STATE_FILTERFAIL_FLAG_SEL_MASK) >> ZLL_SEQ_STATE_FILTERFAIL_FLAG_SEL_SHIFT)
#define ZLL_BRD_SEQ_STATE_FILTERFAIL_FLAG_SEL(base) (BME_UBFX32(&ZLL_SEQ_STATE_REG(base), ZLL_SEQ_STATE_FILTERFAIL_FLAG_SEL_SHIFT, ZLL_SEQ_STATE_FILTERFAIL_FLAG_SEL_WIDTH))
/*@}*/

/*!
 * @name Register ZLL_SEQ_STATE, field CRCVALID[11] (RO)
 *
 * Code Redundancy Check Valid: This flag indicates the compare result between
 * the FCS field, in the most-recently received frame, and the internally
 * calculated CRC value. This flag is cleared at next receiver warm up.
 *
 * Values:
 * - 0b0 - Rx FCS != calculated CRC (incorrect)
 * - 0b1 - Rx FCS = calculated CRC (correct)
 */
/*@{*/
/*! @brief Read current value of the ZLL_SEQ_STATE_CRCVALID field. */
#define ZLL_RD_SEQ_STATE_CRCVALID(base) ((ZLL_SEQ_STATE_REG(base) & ZLL_SEQ_STATE_CRCVALID_MASK) >> ZLL_SEQ_STATE_CRCVALID_SHIFT)
#define ZLL_BRD_SEQ_STATE_CRCVALID(base) (BME_UBFX32(&ZLL_SEQ_STATE_REG(base), ZLL_SEQ_STATE_CRCVALID_SHIFT, ZLL_SEQ_STATE_CRCVALID_WIDTH))
/*@}*/

/*!
 * @name Register ZLL_SEQ_STATE, field PLL_ABORT[12] (RO)
 *
 * This bit reflects the instantaneous, consolidated status of the PLL unlock
 * detection circuits; if asserted high, indicates that at least one of the three
 * PLL unlock detect mechanisms is currently reporting an unlocked condition.
 */
/*@{*/
/*! @brief Read current value of the ZLL_SEQ_STATE_PLL_ABORT field. */
#define ZLL_RD_SEQ_STATE_PLL_ABORT(base) ((ZLL_SEQ_STATE_REG(base) & ZLL_SEQ_STATE_PLL_ABORT_MASK) >> ZLL_SEQ_STATE_PLL_ABORT_SHIFT)
#define ZLL_BRD_SEQ_STATE_PLL_ABORT(base) (BME_UBFX32(&ZLL_SEQ_STATE_REG(base), ZLL_SEQ_STATE_PLL_ABORT_SHIFT, ZLL_SEQ_STATE_PLL_ABORT_WIDTH))
/*@}*/

/*!
 * @name Register ZLL_SEQ_STATE, field PLL_ABORTED[13] (RO)
 *
 * when asserted, indicates that the autosequence has terminated due to an PLL
 * unlock event. This bit is valid at the SEQIRQ interrupt. Hardware will maintain
 * this bit asserted until the next autosequence commences. This bit is a
 * read-only mirror of the register bit of the same name in the ABORT_STS
 * (SEQ_CTRL_STS) register.
 */
/*@{*/
/*! @brief Read current value of the ZLL_SEQ_STATE_PLL_ABORTED field. */
#define ZLL_RD_SEQ_STATE_PLL_ABORTED(base) ((ZLL_SEQ_STATE_REG(base) & ZLL_SEQ_STATE_PLL_ABORTED_MASK) >> ZLL_SEQ_STATE_PLL_ABORTED_SHIFT)
#define ZLL_BRD_SEQ_STATE_PLL_ABORTED(base) (BME_UBFX32(&ZLL_SEQ_STATE_REG(base), ZLL_SEQ_STATE_PLL_ABORTED_SHIFT, ZLL_SEQ_STATE_PLL_ABORTED_WIDTH))
/*@}*/

/*!
 * @name Register ZLL_SEQ_STATE, field RX_BYTE_COUNT[23:16] (RO)
 *
 * During packet reception, this read-only register is a real-time indicator of
 * the number of bytes that have been received. This register will read 0 until
 * SFD and PHR have been received. It will read 1 after the first byte of Frame
 * Control Field has been received, etc.
 */
/*@{*/
/*! @brief Read current value of the ZLL_SEQ_STATE_RX_BYTE_COUNT field. */
#define ZLL_RD_SEQ_STATE_RX_BYTE_COUNT(base) ((ZLL_SEQ_STATE_REG(base) & ZLL_SEQ_STATE_RX_BYTE_COUNT_MASK) >> ZLL_SEQ_STATE_RX_BYTE_COUNT_SHIFT)
#define ZLL_BRD_SEQ_STATE_RX_BYTE_COUNT(base) (BME_UBFX32(&ZLL_SEQ_STATE_REG(base), ZLL_SEQ_STATE_RX_BYTE_COUNT_SHIFT, ZLL_SEQ_STATE_RX_BYTE_COUNT_WIDTH))
/*@}*/

/*!
 * @name Register ZLL_SEQ_STATE, field CCCA_BUSY_CNT[29:24] (RO)
 *
 * For Sequence CCCA mode only, this register indicates the number of "busy" CCA
 * attempts which occurred during the autosequence, before the channel was
 * detected to be idle. This register can also be read in real-time (during the
 * autosequence) to determine how many busy CCA attempts have occurred to that point.
 * The register saturates at 63 (i.e, if there are more than 63 busy attempts, the
 * register will continue to read 63). This register is automatically cleared to
 * zero by hardware when the next autosequence commences. Read-only register.
 */
/*@{*/
/*! @brief Read current value of the ZLL_SEQ_STATE_CCCA_BUSY_CNT field. */
#define ZLL_RD_SEQ_STATE_CCCA_BUSY_CNT(base) ((ZLL_SEQ_STATE_REG(base) & ZLL_SEQ_STATE_CCCA_BUSY_CNT_MASK) >> ZLL_SEQ_STATE_CCCA_BUSY_CNT_SHIFT)
#define ZLL_BRD_SEQ_STATE_CCCA_BUSY_CNT(base) (BME_UBFX32(&ZLL_SEQ_STATE_REG(base), ZLL_SEQ_STATE_CCCA_BUSY_CNT_SHIFT, ZLL_SEQ_STATE_CCCA_BUSY_CNT_WIDTH))
/*@}*/

