RT-Thread/rt-thread/bsp/freescale/platform/devices/MKW30Z4/include/MKW30Z4_extension.h
/*
 * Constants & macros for individual ZLL_LENIENCY_MSB bitfields
 */

/*!
 * @name Register ZLL_LENIENCY_MSB, field LENIENCY_REGISTER[7:0] (RW)
 *
 * LENIENCY BIT PACKET FILTERING RULE OVERRIDDEN leniency[32] Override Stage 2
 * Short Addr Filter for
 * DST_ADDR_MODE_SHORT/SRC_ADDR_MODE_LONG/NO_PAN_ID_COMPRESSION (Data and MAC Command Only) leniency[33] Override Stage 2 PAN ID Filter
 * for DST_ADDR_MODE_LONG/SRC_ADDR_MODE_SHORT/NO_PAN_ID_COMPRESSION (Beacon Only)
 * leniency[34] Override Stage 2 PAN ID Filter for
 * DST_ADDR_MODE_LONG/SRC_ADDR_MODE_SHORT/NO_PAN_ID_COMPRESSI ON (Data and MAC Command Only) leniency[35]
 * Override Stage 2 Long Addr Filter for
 * DST_ADDR_MODE_LONG/SRC_ADDR_MODE_SHORT/NO_PAN_ID_COMPRESSION (Data and MAC Command Only) leniency[36] Override Stage 2 PAN
 * ID Filter for DST_ADDR_MODE_LONG/SRC_ADDR_MODE_LONG (Beacon Only) leniency[37]
 * Override Stage 2 PAN ID Filter for DST_ADDR_MODE_LONG/SRC_ADDR_MODE_LONG (Data
 * and MAC Command Only) leniency[38] Override Stage 2 Long Addr Filter for
 * DST_ADDR_MODE_LONG/SRC_ADDR_MODE_LONG (Data and MAC Command Only) leniency[39]
 * Allow an auto-TxAck frame to be sent, after a receive frame which has all of the
 * following parameters: 1. Destination PAN ID = Broadcast (0xFFFF) 2.
 * Destination Address = !Broadcast (not 0xFFFF) 3. Destination Address Mode = Short
 * Nominally, the SEQ_MGR inhibits auto-TxAck on such frames.
 */
/*@{*/
/*! @brief Read current value of the ZLL_LENIENCY_MSB_LENIENCY_REGISTER field. */
#define ZLL_RD_LENIENCY_MSB_LENIENCY_REGISTER(base) ((ZLL_LENIENCY_MSB_REG(base) & ZLL_LENIENCY_MSB_LENIENCY_REGISTER_MASK) >> ZLL_LENIENCY_MSB_LENIENCY_REGISTER_SHIFT)
#define ZLL_BRD_LENIENCY_MSB_LENIENCY_REGISTER(base) (BME_UBFX32(&ZLL_LENIENCY_MSB_REG(base), ZLL_LENIENCY_MSB_LENIENCY_REGISTER_SHIFT, ZLL_LENIENCY_MSB_LENIENCY_REGISTER_WIDTH))

/*! @brief Set the LENIENCY_REGISTER field to a new value. */
#define ZLL_WR_LENIENCY_MSB_LENIENCY_REGISTER(base, value) (ZLL_RMW_LENIENCY_MSB(base, ZLL_LENIENCY_MSB_LENIENCY_REGISTER_MASK, ZLL_LENIENCY_MSB_LENIENCY_REGISTER(value)))
#define ZLL_BWR_LENIENCY_MSB_LENIENCY_REGISTER(base, value) (BME_BFI32(&ZLL_LENIENCY_MSB_REG(base), ((uint32_t)(value) << ZLL_LENIENCY_MSB_LENIENCY_REGISTER_SHIFT), ZLL_LENIENCY_MSB_LENIENCY_REGISTER_SHIFT, ZLL_LENIENCY_MSB_LENIENCY_REGISTER_WIDTH))
/*@}*/

/*******************************************************************************
 * ZLL_PART_ID - PART ID
 ******************************************************************************/

/*!
 * @brief ZLL_PART_ID - PART ID (RO)
 *
 * Reset value: 0x00000000U
 *
 * Zigbee Part ID
 */
/*!
 * @name Constants and macros for entire ZLL_PART_ID register
 */
/*@{*/
#define ZLL_RD_PART_ID(base)     (ZLL_PART_ID_REG(base))
/*@}*/

/*
 * Constants & macros for individual ZLL_PART_ID bitfields
 */

/*!
 * @name Register ZLL_PART_ID, field PART_ID[7:0] (RO)
 */
/*@{*/
/*! @brief Read current value of the ZLL_PART_ID_PART_ID field. */
#define ZLL_RD_PART_ID_PART_ID(base) ((ZLL_PART_ID_REG(base) & ZLL_PART_ID_PART_ID_MASK) >> ZLL_PART_ID_PART_ID_SHIFT)
#define ZLL_BRD_PART_ID_PART_ID(base) (BME_UBFX32(&ZLL_PART_ID_REG(base), ZLL_PART_ID_PART_ID_SHIFT, ZLL_PART_ID_PART_ID_WIDTH))
/*@}*/

/*******************************************************************************
 * ZLL_PKT_BUFFER - PACKET BUFFER
 ******************************************************************************/

/*!
 * @brief ZLL_PKT_BUFFER - PACKET BUFFER (RW)
 *
 * Reset value: 0x00000000U
 *
 * Packet Buffer
 */
/*!
 * @name Constants and macros for entire ZLL_PKT_BUFFER register
 */
/*@{*/
#define ZLL_RD_PKT_BUFFER(base, index) (ZLL_PKT_BUFFER_REG(base, index))
#define ZLL_WR_PKT_BUFFER(base, index, value) (ZLL_PKT_BUFFER_REG(base, index) = (value))
#define ZLL_RMW_PKT_BUFFER(base, index, mask, value) (ZLL_WR_PKT_BUFFER(base, index, (ZLL_RD_PKT_BUFFER(base, index) & ~(mask)) | (value)))
#define ZLL_SET_PKT_BUFFER(base, index, value) (BME_OR32(&ZLL_PKT_BUFFER_REG(base, index), (uint32_t)(value)))
#define ZLL_CLR_PKT_BUFFER(base, index, value) (BME_AND32(&ZLL_PKT_BUFFER_REG(base, index), (uint32_t)(~(value))))
#define ZLL_TOG_PKT_BUFFER(base, index, value) (BME_XOR32(&ZLL_PKT_BUFFER_REG(base, index), (uint32_t)(value)))
/*@}*/

/* Instance numbers for core modules */
#define JTAG_IDX (0) /*!< Instance number for JTAG. */
#define TPIU_IDX (0) /*!< Instance number for TPIU. */
#define SCB_IDX (0) /*!< Instance number for SCB. */
#define SWD_IDX (0) /*!< Instance number for SWD. */
#define RADIO_IDX (0) /*!< Instance number for RADIO. */
#define ZigBee_IDX (0) /*!< Instance number for ZigBee. */
#define CoreDebug_IDX (0) /*!< Instance number for CoreDebug. */

#if defined(__IAR_SYSTEMS_ICC__)
  /* Restore checking of "Error[Pm008]: sections of code should not be 'commented out' (MISRA C 2004 rule 2.4)" */
  #pragma diag_default=pm008
#endif

#endif /* __MKW30Z4_EXTENSION_H__ */
/* EOF */
